{
  "searchTerms": "Special Needs",
  "searchURL": "http://www.donorschoose.org/donors/search.html?showSynopsis=true&subject7=-7&utm_source=api&utm_medium=feed&utm_content=searchlink&utm_campaign=DONORSCHOOSE",
  "totalProposals": "2210",
  "index": "1",
  "max": "50",
  "breadcrumb": [
    [
      "subject7",
      "-7",
      "Special Needs"
    ],
    [
      "max",
      "50",
      ""
    ]
  ],
  "proposals": [
    {
      "id": "1196045",
      "proposalURL": "http://www.donorschoose.org/project/train-a-child/1196045/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1196045&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1075723_sm.jpg?timestamp=1389280349343",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1075723_thmb.jpg?timestamp=1389280349343",
      "title": "Train a Child",
      "shortDescription": "A typical day in my classroom would look like a day of employment at McDonald&#039;s or Dunkin Donuts. For that hands on training and experience students operate a bakery with delivery service to the...",
      "fulfillmentTrailer": "My students need a Point of Sales System to prepare them for the workforce.  .",
      "snippets": [],
      "synopsis": "A typical day in my classroom would look like a day of employment at McDonald&#039;s or Dunkin Donuts.  For that hands on training and experience students operate a bakery with delivery service to the faculty and staff. For 3 hours a day they serve up coffee, cookies, muffins, tea, lemonade and sandwiches. &lt;br/&gt;&lt;br/&gt;We live in a rural/suburban county in Central Florida where the poverty level is very high.  Students in my Exceptional Student Education (ESE) classes have a variety of disabilities (learning and physical) and receive employability training that will assist them in getting a job once they graduate from high school.  With the training they receive in this class, my students gain the experience needed to find a job outside of the classroom. \r\n\r\nStudents are required to wear uniforms, punch a time clock, receive a paycheck (spendable in our classroom bakery) and are evaluated based on their performance.  In a given day we serve over 400 students, faculty, and staff! Where students were once unknown to the student body, they are now the most popular kids on campus. \r\n\r\nI teach the students to have high expectations of themselves and they can reach any goal they set out to achieve. &lt;br/&gt;&lt;br/&gt;Our classroom is set up like a bakery, we are equipped with ovens to bake cookies, a microwave, fry pan, coffee machines, and refrigerator. We have a counter and a cash register. With the POS system, students will use the POS system for processing (taking) orders, simulating what they would use in places like McDonald&#039;s, Burger King, Publix, etc.  They are trained on how to count money, give back change and fulfill an order.  When they graduate, they will be able to list their training in this class as job experience. &lt;br/&gt;&lt;br/&gt;Donations to this project will make a difference in a child&#039;s life by giving them the experience they need to be confident and a productive member of society.  They feel like they have the abilities and confidence to start life as adult without being totally dependent on their caregivers. &#034;Building confidence one student at a time.&#034;",
      "percentFunded": "88",
      "numDonors": "5",
      "costToComplete": "31.22",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "250.22",
      "freeShipping": "true",
      "teacherId": "1075723",
      "teacherName": "Mrs. Ponder",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 13,
          "name": "CenturyLink"
        }
      ],
      "schoolName": "West Port High School",
      "schoolUrl": "http://www.donorschoose.org/school/west-port-high-school/69377/",
      "city": "Ocala",
      "zip": "34481-5406",
      "state": "FL",
      "stateFullName": "Florida",
      "latitude": "29.153526000000000",
      "longitude": "-82.249741000000000",
      "zone": {
        "id": "312",
        "name": "Florida"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "16",
        "name": "College &amp; Career Prep",
        "groupId": "5"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-05",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1158768",
      "proposalURL": "http://www.donorschoose.org/project/math-made-easy/1158768/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1158768&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2173127_sm.jpg?timestamp=1388248477478",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2173127_thmb.jpg?timestamp=1388248477478",
      "title": "Math Made Easy!",
      "shortDescription": "I have the wonderful opportunity to help include students with disabilities in regular classrooms. Because my students are a part of a regular classroom for all parts of the day, they must...",
      "fulfillmentTrailer": "My students need math manipulatives and organization tools to help them learn their basic math facts.",
      "snippets": [],
      "synopsis": "I have the wonderful opportunity to help include students with disabilities in regular classrooms.  Because my students are a part of a regular classroom for all parts of the day, they must participate in all aspects of the classroom which includes the challenging grade level standards. &lt;br/&gt;&lt;br/&gt;I have 17 students in 2 regular education 4th grade classrooms.  We are a Title 1 school, in an economically disadvantaged area of south Georgia and 100% of the students at our school receive free breakfast and lunch each day.  My students&#039; disabilities include learning disabilities in reading, writing and math, ADHD, behavior/emotional disorders and Asperger Syndrome. They are very hard workers and want to be a part of a regular classroom. &lt;br/&gt;&lt;br/&gt;My students have been very successful in the regular classrooms despite the academic deficits they have.  We often work in small groups to address their individual needs and teach them skills to be able to be successful in the regular classroom. Because they have math and reading deficits their disabilities can have a negative impact on their performance throughout their academic day. It is important for my students to have creative opportunities to learn their basic math facts so that when they are taught grade level skills, they are not hindered by basic math facts. I have a new strategy to help the students learn their facts but it requires some supplies that we do not have at my school. &lt;br/&gt;&lt;br/&gt;The manipulatives and supplies provided through this grant will give students with disabilities another way to learn their basic math facts by using hands on activities. Often times, it just takes teaching a skill in a little different way for it to click with my students with disabilities.",
      "percentFunded": "91",
      "numDonors": "6",
      "costToComplete": "31.33",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "341.33",
      "freeShipping": "true",
      "teacherId": "2173127",
      "teacherName": "Mrs. Finch",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        }
      ],
      "schoolName": "Cross Creek Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/cross-creek-elementary-school/55385/",
      "city": "Thomasville",
      "zip": "31757-8130",
      "state": "GA",
      "stateFullName": "Georgia",
      "latitude": "30.867474000000000",
      "longitude": "-83.948631000000000",
      "zone": {
        "id": "313",
        "name": "Georgia"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "8",
        "name": "Mathematics",
        "groupId": "4"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-04-30",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1186990",
      "proposalURL": "http://www.donorschoose.org/project/more-leveled-readers-please/1186990/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1186990&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1842493_sm.jpg?timestamp=1394898354359",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1842493_thmb.jpg?timestamp=1394898354359",
      "title": "More Leveled Readers Please!",
      "shortDescription": "&#034;Unless someone like you cares a whole awful lot, nothing is going to get better. It&#039;s not. - Dr. Seuss&lt;br /&gt;&lt;br /&gt;Learning to read is an amazing time in a child&#039;s life. My students are eager to read...",
      "fulfillmentTrailer": "My students need books to read that are at their instructional level and bin to store them in.",
      "snippets": [],
      "synopsis": "&#034;Unless someone like you cares a whole awful lot, nothing is going to get better.  It&#039;s not.  - Dr. Seuss\r\n\r\nLearning to read is an amazing time in a child&#039;s life. My students are eager to read everything. It can be frustrating though when they don&#039;t have access to books at their levels. &lt;br/&gt;&lt;br/&gt;We are a small school district that borders Detroit. We have a large population of students that are living in poverty with 100% of our students eligible for free breakfast, lunch, and dinner. I teach in a special education resource room for students in grades K-3. Most of my students are reading significantly below grade level. This affects their ability to be successful in all academic areas. &lt;br/&gt;&lt;br/&gt;I have started incorporating The Daily 5 into my daily literacy block. The Daily 5 provides literacy structure that allows for differentiation in the classroom. One of the choices is read to self. It is the foundation for creating independent readers. It is important for students to find &#034; Good Fit Books&#034;. This is a book that the reader enjoys, which can be read with accuracy, fluency and comprehension. Although I have many books in my room, they are not all &#034;Good Fit Books&#034;. \r\n\r\nI was fortunate to have a project funded that allowed me to get level C and level F books for my classroom.  This is a nice start, but I have students at many different levels.  I need to add a variety of levels to reach more readers.  My students will use these new level H and level K books independently or will read with a partner while I am providing small group instruction. I am asking for a book box to hold the books. I will use the More Read and Understand book during my small group instruction. &lt;br/&gt;&lt;br/&gt;By donating to my project  you will be helping to build a leveled library. My students will improve their reading fluency by having &#034;Good Fit Books&#034; to read. These books will provide my students with the opportunity to become strong and confident readers.",
      "percentFunded": "76",
      "numDonors": "6",
      "costToComplete": "59.92",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "248.20",
      "freeShipping": "true",
      "teacherId": "1842493",
      "teacherName": "Ms. Brown",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [
        {
          "id": 9,
          "name": "NEA Member"
        },
        {
          "id": 5,
          "name": "SONIC Teacher"
        }
      ],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        }
      ],
      "schoolName": "Beacon Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/beacon-elementary-school/73255/",
      "city": "Harper Woods",
      "zip": "48225-2010",
      "state": "MI",
      "stateFullName": "Michigan",
      "latitude": "42.435335000000000",
      "longitude": "-82.937660000000000",
      "zone": {
        "id": "212",
        "name": "Michigan"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "1",
        "name": "Books"
      },
      "expirationDate": "2014-05-07",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1170513",
      "proposalURL": "http://www.donorschoose.org/project/supplies-to-get-us-through-the-rest-of-t/1170513/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1170513&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u417621_sm.jpg?timestamp=1254779922000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u417621_thmb.jpg?timestamp=1254779922000",
      "title": "Supplies To Get Us Through The Rest Of The Year!",
      "shortDescription": "When teaching students with disabilities, it becomes necessary to develop different ways to let them show that they understand the concepts being taught. Differentiating instruction and teaching...",
      "fulfillmentTrailer": "My students need paint, paint brushes, markers, poster board, glitter, and more to help them express their understanding of concepts taught.",
      "snippets": [],
      "synopsis": "When teaching students with disabilities, it becomes necessary to develop different ways to let them show that they understand the concepts being taught. Differentiating instruction and teaching to their learning styles helps them understand the concepts being taught.  &lt;br/&gt;&lt;br/&gt;My students are eleventh and twelfth graders with disabilities. They are classified as emotionally disturbed.   I currently teach these students English, United States History, and United States Government.   My students have faced numerous obstacles in their lives and it is a major accomplishment that they still come to school on a daily basis.  My lovely bunch continues to impress me day after day as I watch them rise to every challenge that I put before them.  \r\n\r\nI have to constantly be creative and think outside of the box for ways to engage my students in activities.  By making lessons creative, I can hook my students into learning and actually get them to enjoy the learning process.  My students constantly give me their all on a day to day basis and it is my duty to try to get them all of the resources possible to help them succeed. &lt;br/&gt;&lt;br/&gt;I can always find a student that is drawing at every possible opportunity. In general my students really enjoy art. My students need paint, paint brushes, markers, poster board, glitter, and more so that they can express their creativity. These supplies will help me continue to be creative with my students.  The supplies will give my students another method to express their understanding of concepts. The supplies will also allow them to express their creative and artistic skills.   &lt;br/&gt;&lt;br/&gt;These supplies will make a huge difference in my classroom.  They will give my students that like to draw another way to show that they understand the concepts being taught in class.  By giving my students an additional way to express themselves, they will be more likely to remember key concepts in the course. This learning can then be shared by students with their classmates to help deepen the learning for everyone.",
      "percentFunded": "83",
      "numDonors": "4",
      "costToComplete": "85.78",
      "matchingFund": {
        "matchingKey": "ATT14",
        "name": "AT&amp;T Foundation",
        "type": "DYI",
        "logoURL": "http://cdn.donorschoose.net/images/logos/att_135.gif",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=ATT14",
        "amount": "254.60",
        "description": "<p align=\"center\"><img src=\"http://cdn.donorschoose.net/images/logos/att_250.gif\"><\/p>\r\n\r\n<p>You can bring this project to life at half the cost!<\/p>\r\n\r\n<p>The AT&T Foundation will fund 50% of this project if someone like you provides the remainder. By completing this project, you will double the impact of your donation.<\/p>\r\n\r\n<p>At AT&T we believe that investing in education is one of the most important things we can do for a strong future. It's an issue that's important to us, our customers and our country.  The support for DonorsChoose.org is part of AT&T Aspire, the company's $350 million commitment to education. AT&T is funding projects at schools that need it most, with the goal of equipping students with the tools necessary to graduate high school and succeed in college, careers and life.<\/p>\r\n\r\n<p><a target=\"_blank\" href=\"../donors/search.html?matchingId=735\">See all projects eligible for this match offer.<\/a><\/p>"
      },
      "totalPrice": "509.20",
      "freeShipping": "true",
      "teacherId": "417621",
      "teacherName": "Ms. Lavergne",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 5,
        "name": "SONIC Teacher"
      }],
      "schoolTypes": [
        {
          "id": 5,
          "name": "Year Round"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "PS 371k Lillian L Rashkis",
      "schoolUrl": "http://www.donorschoose.org/school/ps-371k-lillian-l-rashkis/812/",
      "city": "Brooklyn",
      "zip": "11232-2505",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.654386000000000",
      "longitude": "-74.005757000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "9",
        "name": "History &amp; Geography",
        "groupId": "3"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-05-19",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1175985",
      "proposalURL": "http://www.donorschoose.org/project/just-right-books-for-reluctant-readers/1175985/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1175985&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1946784_sm.jpg?timestamp=1377882313452",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1946784_thmb.jpg?timestamp=1377882313452",
      "title": "Just Right Books For Reluctant Readers!",
      "shortDescription": "Reading can be an awesome adventure, or a frustrating task. My students are struggling readers whose frustration of not being able to read easily hinders their love for literature. I want to...",
      "fulfillmentTrailer": "My students need engaging leveled books!",
      "snippets": [],
      "synopsis": "Reading can be an awesome adventure, or a frustrating task. My students are struggling readers whose frustration of not being able to read easily hinders their love for literature. I want to change that, but I need your help.  &lt;br/&gt;&lt;br/&gt;I am a special education teacher with 19 students all with reading disabilities, language impairments, autism, or a mixture of all three. It breaks my heart everyday to hear my students groan and see their eyes roll in disgust when it is time to start reading for the day. They try so hard but are often left to read books that are not age appropriate or engaging because of their lower reading levels. I just wish that my students could fall in love with books like I did when I was their age. I try to make my lessons as fun and engaging as possible but without the right books, little can motivate these reluctant readers to perform.  &lt;br/&gt;&lt;br/&gt;With your help, I would love to provide my students with age-appropriate, motivating, and engaging fiction and non-fiction books that are tailored to their unique reading levels. If the students are given the books that they will enjoy, I know I can help them to see how amazing reading can really be. This will lead them to reading more and increasing their reading levels to hopefully read and comprehend grade-level text with ease. The titles that your donations would provide will give my students the opportunity to learn and grow while reading books that they will love. Better readers start with better books!  &lt;br/&gt;&lt;br/&gt;These books are just the beginning of creating life-long readers. Nothing would make me happier than seeing my students get excited to come to the guided reading table everyday. Exposing my students to awesome literature written at their reading level will motivate them to explore similar titles are their own; creating independent readers with a love of literature. After all, it all starts with the right book!",
      "percentFunded": "77",
      "numDonors": "4",
      "costToComplete": "53.59",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "228.59",
      "freeShipping": "false",
      "teacherId": "1946784",
      "teacherName": "Mrs. Hyre",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        }
      ],
      "schoolName": "Bellamy Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/bellamy-elementary-school/46293/",
      "city": "Tampa",
      "zip": "33615-1339",
      "state": "FL",
      "stateFullName": "Florida",
      "latitude": "28.036039000000000",
      "longitude": "-82.566547000000000",
      "zone": {
        "id": "312",
        "name": "Florida"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      }],
      "resource": {
        "id": "1",
        "name": "Books"
      },
      "expirationDate": "2014-05-29",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1154846",
      "proposalURL": "http://www.donorschoose.org/project/tool-for-prader-willis-syndrome-child/1154846/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1154846&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1060621_sm.jpg?timestamp=1379201049329",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1060621_thmb.jpg?timestamp=1379201049329",
      "title": "Tool for Prader Willis Syndrome Child",
      "shortDescription": "Entering my classroom is like entering a judgment free zone. Everyone helps one another, encourages one another and strives to do their very best, as a team. 21 second graders grow their minds,...",
      "fulfillmentTrailer": "My students need an iPad, so that everyone can communicate and learn together.",
      "snippets": [],
      "synopsis": "Entering my classroom is like entering a judgment free zone.  Everyone helps one another, encourages one another and strives to do their very best, as a team.  &lt;br/&gt;&lt;br/&gt;21 second graders grow their minds, bodies and souls, within our inner city classroom.  The students beg to remain in the classroom at the end of the school day. Obviously, they love learning and care for each other a lot. We have 4 English Language Learners, 3 students with severe ADHD and 1 boy with many special needs. He has been diagnosed with Prader Willis Syndrome, Autism, Mutism and Narcolepsy and has a paraprofessional supporting him with daily activities. \r\n\r\nAll students at our school recieve free breakfast and lunch due to the high poverty rate in the community. Our school also provides many with hats, gloves, and jackets during the cold winter months.  &lt;br/&gt;&lt;br/&gt;All students in my class will be able to benefit from this technology.\r\nMutism can be overcome with the help of the iPad. This young boy will have a voice for the first time in his life, by using a free app! His mind can be stimulated with the colorful and interactive apps, which research has proven to assist autistic students. This stimulation can help keep him awake in class! The ipad mini will make turning the pages of a book easier for his poor fine motor skills to handle! (Sorry, I get a bit hopeful when I talk about iPads and this boy.)\r\nResearch shows that part of the reason why inner city students score lower than their suburban peers is because they are not familiar with the technology, which is being used to evaluate them. Never mind the fact that students are almost expected to enter their career with knowledge of technology. \r\n\r\nStudents will all also use the IXL app amoung others.  &lt;br/&gt;&lt;br/&gt;Plain and simple, the iPad will change our lives forever. A voice will be given to a child who so desperately deserves it. Students will grow together with the help of this technology that others take for granted. Thank you! :)",
      "percentFunded": "70",
      "numDonors": "11",
      "costToComplete": "136.27",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "455.39",
      "freeShipping": "false",
      "teacherId": "1060621",
      "teacherName": "Ms. Lukawicz",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "Parkville Community School",
      "schoolUrl": "http://www.donorschoose.org/school/parkville-community-school/43704/",
      "city": "Hartford",
      "zip": "06106-2160",
      "state": "CT",
      "stateFullName": "Connecticut",
      "latitude": "41.756275000000000",
      "longitude": "-72.707565000000000",
      "zone": {
        "id": "101",
        "name": "Connecticut"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-04-17",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1193629",
      "proposalURL": "http://www.donorschoose.org/project/tell-me-and-ill-forget-show-me-and-i/1193629/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1193629&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u551462_sm.jpg?timestamp=1393715695579",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u551462_thmb.jpg?timestamp=1393715695579",
      "title": "Tell Me, and I&#039;ll Forget. Show Me, and I&#039;ll Remember.",
      "shortDescription": "For students with disabilities and English language learners, school can be profoundly frustrating and overwhelming. Too many do not even finish high school. Text and lecture supported by visual...",
      "fulfillmentTrailer": "My students need an LCD Projector and Document camera to support their unique needs as special education students and English language learners.",
      "snippets": [],
      "synopsis": "For students with disabilities and English language learners, school can be profoundly frustrating and overwhelming. Too many do not even finish high school. Text and lecture supported by visual aids, video, and interactive programs help them process material that would otherwise be inaccessible. &lt;br/&gt;&lt;br/&gt;My students are Special Education students and English language learners in a Chicago neighborhood school that serves a high-poverty population. They are an extremely diverse group of learners, and represent many different races, religions, languages, and socio-economic and cultural backgrounds. \r\nMy school serves many immigrant families from around the world, and often my students enter high school with interruptions in schooling due to homelessness, transience, and lack of access to education in their home countries. Most of my students enter school with literacy and math skills significantly below grade level, in addition to the challenges of language barriers and disabilities. \r\nFor my students, math and science classes are often inaccessible and overwhelming, due to the technical language used, cumulative skills required, and complex processing skills needed to master new content and skills. &lt;br/&gt;&lt;br/&gt;With a document camera and LCD projector dedicated exclusively to meeting the needs of special education students and ELLs, I could provide much needed support and supplemental instruction in the form of visual aids, video, interactive simulations, and online activities both in my inclusion classrooms and through individual/small group instruction. \r\n\r\nUsing a document camera would enable me to model critical skills like note-taking, annotation, and problem solving in a multi-modal way that engages students&#039; multiple intelligences and shows them in real time exactly what they need to do to be successful. Since many of my students have deficits in auditory processing, visual input is essential to remembering and understanding instructions and classroom tasks. \r\n\r\nUsing this technology with small groups during pull-out instruction would enable me to maximize the efficiency of precious instructional time, and help them keep pace with their classmates in general education courses. &lt;br/&gt;&lt;br/&gt;Your support helps ensure equity and access in education for Chicago&#039;s most vulnerable populations. Research consistently shows that students who interact with content in varied and multi-modal ways develop skills more quickly, perform better academically, demonstrate higher self-confidence, and are more motivated and engaged in their educations.\r\n\r\nPlease help bridge the achievement gap for students with special learning needs by giving them access to this powerful and much- needed technology.",
      "percentFunded": "87",
      "numDonors": "11",
      "costToComplete": "179.07",
      "completedMatching": {
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "http://cdn.donorschoose.net/images/logos/100Women_small.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=100WOMENP14",
        "amount": "0.00",
        "completed": "true",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "matchingFund": {
        "matchingKey": "ATT14",
        "name": "AT&amp;T Foundation",
        "type": "DYI",
        "logoURL": "http://cdn.donorschoose.net/images/logos/att_135.gif",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=ATT14",
        "amount": "714.66",
        "description": "<p align=\"center\"><img src=\"http://cdn.donorschoose.net/images/logos/att_250.gif\"><\/p>\r\n\r\n<p>You can bring this project to life at half the cost!<\/p>\r\n\r\n<p>The AT&T Foundation will fund 50% of this project if someone like you provides the remainder. By completing this project, you will double the impact of your donation.<\/p>\r\n\r\n<p>At AT&T we believe that investing in education is one of the most important things we can do for a strong future. It's an issue that's important to us, our customers and our country.  The support for DonorsChoose.org is part of AT&T Aspire, the company's $350 million commitment to education. AT&T is funding projects at schools that need it most, with the goal of equipping students with the tools necessary to graduate high school and succeed in college, careers and life.<\/p>\r\n\r\n<p><a target=\"_blank\" href=\"../donors/search.html?matchingId=735\">See all projects eligible for this match offer.<\/a><\/p>"
      },
      "totalPrice": "1429.32",
      "freeShipping": "false",
      "teacherId": "551462",
      "teacherName": "Ms. Wieselman",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 5,
        "name": "SONIC Teacher"
      }],
      "schoolTypes": [{
        "id": 4,
        "name": "Magnet"
      }],
      "schoolName": "Nicholas Senn High School",
      "schoolUrl": "http://www.donorschoose.org/school/senn-metro-academy/5638/",
      "city": "Chicago",
      "zip": "60660-3397",
      "state": "IL",
      "stateFullName": "Illinois",
      "latitude": "41.989104000000000",
      "longitude": "-87.665157000000000",
      "zone": {
        "id": "201",
        "name": "Illinois (Chicago)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "25",
        "name": "ESL",
        "groupId": "6"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-01",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1181836",
      "proposalURL": "http://www.donorschoose.org/project/non-verbal-autistic-students-need-z-vibe/1181836/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1181836&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2154651_sm.jpg?timestamp=1391869516749",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2154651_thmb.jpg?timestamp=1391869516749",
      "title": "Non-Verbal Autistic Students Need Z-Vibe",
      "shortDescription": "My students are Non-Verbal and are constantly struggling with communication. They deserve the appropriate tools needed to help facilitate speech, despite them attending school in a high-poverty,...",
      "fulfillmentTrailer": "My students need a Z-Vibe tool for oral-motor stimulation and sensory input.",
      "snippets": [],
      "synopsis": "My students are Non-Verbal and are constantly struggling with communication. They deserve the appropriate tools needed to help facilitate speech, despite them attending school in a high-poverty, high-crime neighborhood. &lt;br/&gt;&lt;br/&gt;My students are five and six year old non-verbal students who enjoy learning and exploring.  They attend an offsite school that receives very little to no supplies, let alone speech tools such as Z-Vibes, that can improve my students&#039; speech.  I am requesting 2 Z-Vibes to access ways to help my students communicate and learn. The Z-Vibes will truly be an irreplaceable speech tool in my classroom. &lt;br/&gt;&lt;br/&gt;The Z-Vibe is a vibrating tool for oral-motor stimulation and sensory input. The Z-Vibe provides gentle vibrations that are great for stimulating the gums, palate, tongue, mouth, cheeks and lips.  The z vibe is great for strengthening oral awareness and motor function.  This tool will benefit my students in many areas, including: articulation, auditory discrimination and language stimulation. &lt;br/&gt;&lt;br/&gt;By donating to this project you will be giving a child a voice.  Not only do Z-Vibes facilitate their learning, but it reinforces skills that are critical for students on the spectrum. Every dollar is one step closer to positively impacting not only my students, but future students that follow.",
      "percentFunded": "71",
      "numDonors": "2",
      "costToComplete": "49.84",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "169.84",
      "freeShipping": "false",
      "teacherId": "2154651",
      "teacherName": "Ms. Kokkinos",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "P369K @ P67K",
      "schoolUrl": "http://www.donorschoose.org/school/p369k---p67k/98705/",
      "city": "Brooklyn",
      "zip": "11205",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.694501000000000",
      "longitude": "-73.977848000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "18",
        "name": "Early Development",
        "groupId": "5"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-06-08",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1201036",
      "proposalURL": "http://www.donorschoose.org/project/let-there-be-light/1201036/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1201036&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1127344_sm.jpg?timestamp=1386302295518",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1127344_thmb.jpg?timestamp=1386302295518",
      "title": "Let there be Light!",
      "shortDescription": "True expression is the key to success. My students are in need of a place where they can tell their story and where they will be heard. Coming from neighborhoods with minimal opportunity, my...",
      "fulfillmentTrailer": "My students need three light boxes for drawing class and Velcro to adhere final drawings to matte board.",
      "snippets": [],
      "synopsis": "True expression is the key to success. My students are in need of a place where they can tell their story and where they will be heard. Coming from neighborhoods with minimal opportunity, my students use the resources of the Talent/Art Class as a place to safely express themselves.\r\n &lt;br/&gt;&lt;br/&gt;The majority of my students are English Language Learners and Special Needs students. They are struggling financially and come from neighborhoods full of crime and gang activity. They are high school students and they are preparing themselves to enter the world as young adults. Our school is a safe zone, full of caring individuals who treat our student body as family. Unfortunately, due to a lack of funding, our ability to purchase materials has been cut tremendously. Many of my students would like to pursue higher education or obtain a career in a field relating to the arts. These materials would allow the students to improve their art-making techniques while expanding their portfolios.  &lt;br/&gt;&lt;br/&gt;Having light boxes in the classroom will allow students two practice art making techniques. They will be able to reference major works of art and use the light box to copy those techniques of art making while developing their own personal style. Many of my students love cartooning and the light box will allow them to create characters in a step by step process. Many of my students have desires to apply to major universities and schools. Good materials to create their artwork is crucial for a quality portfolio, in which colleges and jobs will look. Students also have more confidence and self-esteem when they know they are using and trusted with materials that will ensure their success.  &lt;br/&gt;&lt;br/&gt;These materials will have both an immediate impact as well as a long term impact. The light boxes and markers will allow students this year to be independent, innovative and creative with their art making. These materials will last for years to come, ensuring that the students of future classes will have quality art materials to ensure success in their futures.",
      "percentFunded": "71",
      "numDonors": "2",
      "costToComplete": "85.35",
      "completedMatching": {
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "http://cdn.donorschoose.net/images/logos/100Women_small.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=100WOMENP14",
        "amount": "0.00",
        "completed": "true",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "290.35",
      "freeShipping": "true",
      "teacherId": "1127344",
      "teacherName": "Ms. Pawson",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 2,
        "name": "NY Teaching Fellow"
      }],
      "schoolTypes": [],
      "schoolName": "Juan Morel Campos Secondary School",
      "schoolUrl": "http://www.donorschoose.org/school/juan-morel-campos-secondary-school/554/",
      "city": "Brooklyn",
      "zip": "11206-2966",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.703834000000000",
      "longitude": "-73.953064000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "11",
        "name": "Visual Arts",
        "groupId": "1"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-11",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1171210",
      "proposalURL": "http://www.donorschoose.org/project/whisper-reading-to-success/1171210/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1171210&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u204790_sm.jpg?timestamp=1340410279000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u204790_thmb.jpg?timestamp=1340410279000",
      "title": "Whisper Reading To Success!",
      "shortDescription": "&#034;Can I use a whisper phone?&#034; This is something many of students ask, but unfortunately after years of use I only have a few whisper phones available. I would love to be able to provide this...",
      "fulfillmentTrailer": "My students need 30 whisper phones to help them improve their reading skills.",
      "snippets": [],
      "synopsis": "&#034;Can I use a whisper phone?&#034;  This is something many of students ask, but unfortunately after years of use I only have a few whisper phones available.  I would love to be able to provide this wonderful tool to every student in my class! &lt;br/&gt;&lt;br/&gt;I have the pleasure of teaching wonderful second grade students in Pennsylvania. These children are a true pleasure to teach and remind me daily why I love teaching. They face many challenges on a daily basis, however they always give their all and truly want to learn! &lt;br/&gt;&lt;br/&gt;The whisper phones will allow the children to listen to themselves read without being distracted by the other children. This will allow them to truly focus on what they are reading, giving them the opportunity to improve their accuracy and think about what they are reading. This will help them improve their fluency and reading comprehension skills. These whisper phones will be used on a daily basis to help the students improve their fluency and comprehension skills. The students will also use these phones while taking a reading, science, math, or social studies test.&lt;br/&gt;&lt;br/&gt;Your donation will give a wonderful group of children the opportunity to improve their reading skills.  You will be providing them with a tool that will help them gain lifelong skills.  Additionally, your donation will make a group of well-deserving children very happy!",
      "percentFunded": "81",
      "numDonors": "3",
      "costToComplete": "36.49",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "196.49",
      "freeShipping": "true",
      "teacherId": "204790",
      "teacherName": "Mrs. Bolonski",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [
        {
          "id": 5,
          "name": "SONIC Teacher"
        },
        {
          "id": 7,
          "name": "U.S. Cellular Teacher"
        }
      ],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        }
      ],
      "schoolName": "Lincoln Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/lincoln-elementary-school/90532/",
      "city": "Pottstown",
      "zip": "19464-5272",
      "state": "PA",
      "stateFullName": "Pennsylvania",
      "latitude": "40.255996000000000",
      "longitude": "-75.647766000000000",
      "zone": {
        "id": "113",
        "name": "Pennsylvania"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "6",
        "name": "Other"
      },
      "expirationDate": "2014-05-21",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1194223",
      "proposalURL": "http://www.donorschoose.org/project/little-ones-would-love-a-laminator/1194223/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1194223&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u554954_sm.jpg?timestamp=1379014632557",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u554954_thmb.jpg?timestamp=1379014632557",
      "title": "Little Ones Would Love a Laminator!",
      "shortDescription": "As an educator, I am always looking for new and lasting ways to keep my students engaged in their learning. One way I think I can accomplish this goal is to have a personal classroom laminator to...",
      "fulfillmentTrailer": "My students need a new laminator and laminating pouches to help make manipulatives and learning activities more durable.",
      "snippets": [],
      "synopsis": "As an educator, I am always looking for new and lasting ways to keep my students engaged in their learning. One way I think I can accomplish this goal is to have a personal classroom laminator to laminate small group games, task cards, and student work for display in and out of the classroom. &lt;br/&gt;&lt;br/&gt;My students are incredible! I have 8 motivated students eager to learn. My students are diagnosed with a variety of disabilities including: intellectually disabled, speech and language impaired, learning disabled, and autistic.  My students come from a low socioeconomic background with limited resources available. We are a Title 1 school with a 100% free lunch program. Many parents work 2 jobs and are barely able to support the family. I know that if we provide them with the right support, resources, and opportunities, they can experience success. &lt;br/&gt;&lt;br/&gt;This laminator and the lamination sheets are going to greatly benefit my students. It will make their materials sturdy and long lasting. This laminator will contribute to all areas of their learning including: math, language arts, science, art and daily living. Their learning materials will be much more sturdy and durable. Throughout the day we go through several manipulative&#039;s and when they aren&#039;t laminated they just don&#039;t last as long. I would also be able to print and laminate student work. &lt;br/&gt;&lt;br/&gt;This project is going to greatly help our classroom. Our manipulative&#039;s and icons will last much longer. My students will benefit from this laminator across all subjects and it will be in use every day. I think its important for students to see their work on display and preserved for later sharing and memories.",
      "percentFunded": "69",
      "numDonors": "5",
      "costToComplete": "81.29",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "260.94",
      "freeShipping": "true",
      "teacherId": "554954",
      "teacherName": "Ms. Zaidman",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 4,
          "name": "Magnet"
        },
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "PS 251 Queens",
      "schoolUrl": "http://www.donorschoose.org/school/ps-251-queens/1048/",
      "city": "Sprngfld Gdns",
      "zip": "11413-3344",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.664344000000000",
      "longitude": "-73.759986000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "18",
        "name": "Early Development",
        "groupId": "5"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-05-02",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1202921",
      "proposalURL": "http://www.donorschoose.org/project/making-literature-come-to-life-in-our-sp/1202921/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1202921&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2130631_sm.jpg?timestamp=1393771372839",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2130631_thmb.jpg?timestamp=1393771372839",
      "title": "Making Literature Come to Life in Our Special Ed Class!",
      "shortDescription": "It has been said that books open our eyes to the world around us. My students have significant disabilities that create barriers to accessing literature. They need listening center materials so...",
      "fulfillmentTrailer": "My students need 4 CD players, activity centers and books on CDs to create a listening center for literacy time for our special education classroom.",
      "snippets": [],
      "synopsis": "It has been said that books open our eyes to the world around us. My students have significant disabilities that create barriers to accessing literature. They need listening center materials so they can have their eyes, and ears, opened to the world of reading! &lt;br/&gt;&lt;br/&gt;Our school is home to about 300 students in a high poverty, inner city neighborhood. Due to low enrollment and changes within our school district, our school was one step away from being closed last year. Despite the challenges that my students face, they are incredibly resilient. \r\nThe seven students that learn in my classroom all have low incidence disabilities such as Autism Spectrum Disorders and Down Syndrome. Their vivacious personalities, zest for life, desire to learn, and boldness are a huge part of our school culture. They do not let developmental delays or poverty get in the way of their learning. I truly LOVE my job as their teacher and cannot imagine teaching a different group of children. &lt;br/&gt;&lt;br/&gt;We are requesting a variety of books on CD so that my students can listen to books and follow along while myself and my classroom assistants work with other children. These books on CD will foster independence within each little learner as they learn how to use the materials and follow the routine by themselves. \r\nAdditionally, we are requesting a listening and following directions activity center. The listening activities on these CDs will help my students to understand concepts such as positional words and &#034;wh&#034; questions about illustrations. \r\nOf course, none of these materials will be useful without CD players! We also need 4 individual CD players so these materials can be accessed appropriately.  &lt;br/&gt;&lt;br/&gt;The materials we are requesting will help my students become more independent, expose them to literature in a new way, and help refine and teach new skills. Please help open the world of reading to my seven deserving learners!",
      "percentFunded": "78",
      "numDonors": "2",
      "costToComplete": "96.66",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "teacherFFPromoCodeFund": {
        "eligible": "true",
        "deadline": "March 22",
        "code": "100WOMEN",
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "100Women_small.jpg",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "totalPrice": "446.66",
      "freeShipping": "true",
      "teacherId": "2130631",
      "teacherName": "Ms. G",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 5,
        "name": "SONIC Teacher"
      }],
      "schoolTypes": [
        {
          "id": 4,
          "name": "Magnet"
        },
        {
          "id": 3,
          "name": "Special Education"
        }
      ],
      "schoolName": "William H Brown Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/william-h-brown-elementary-school/5856/",
      "city": "Chicago",
      "zip": "60612-2631",
      "state": "IL",
      "stateFullName": "Illinois",
      "latitude": "41.882814000000000",
      "longitude": "-87.670721000000000",
      "zone": {
        "id": "201",
        "name": "Illinois (Chicago)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-14",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1205414",
      "proposalURL": "http://www.donorschoose.org/project/lights-camera-learning/1205414/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1205414&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1155963_sm.jpg?timestamp=1328280351000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1155963_thmb.jpg?timestamp=1328280351000",
      "title": "Lights, Camera, Learning!",
      "shortDescription": "Drop the pencil. Put away that worksheet. Today in speech therapy we&#039;re producing our own short film. My students have mild to moderate cognitive disabilities and language learning challenges....",
      "fulfillmentTrailer": "My students need a lighting kit and backdrops (with case) to produce educational videos for peers.",
      "snippets": [],
      "synopsis": "Drop the pencil. Put away that worksheet. Today in speech therapy we&#039;re producing our own short film. &lt;br/&gt;&lt;br/&gt;My students have mild to moderate cognitive disabilities and language learning challenges. Some are on the autism spectrum. For them, understanding what they hear, finding the right words, and expressing themselves is tough. They&#039;re high school students who&#039;ve seen it all in speech-language therapy... or have they? &lt;br/&gt;&lt;br/&gt;Last year, we started a video production group. Together we plan, write, produce, film, and edit short films that demonstrate our learning. We&#039;ve made vocabulary come to life and created how-to videos for vocational skills. We share these videos with the younger classes and help them learn new skills too. My students have really taken to this experience. Writing and revising isn&#039;t a chore when its purpose is to get our script just right. I&#039;m seeing a level of engagement and independence that I&#039;ve never seen before. I&#039;m also seeing some students set realistic goals to pursue video production as a career after graduation. They&#039;re not only acquiring new language; they&#039;re learning a marketable skill! We&#039;re ready to advance to the next level. We&#039;re requesting a lighting kit and backdrops so that our videos can be better quality and so we can learn more about actual video production. &lt;br/&gt;&lt;br/&gt;I&#039;m so thrilled by the creativity and innovation demonstrated by my students. I hope you are as excited by this project as we are and that you&#039;ll consider helping us accomplish our goals. Thank you for your consideration.",
      "percentFunded": "75",
      "numDonors": "3",
      "costToComplete": "60.33",
      "matchingFund": {
        "matchingKey": "ATT14",
        "name": "AT&amp;T Foundation",
        "type": "DYI",
        "logoURL": "http://cdn.donorschoose.net/images/logos/att_135.gif",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=ATT14",
        "amount": "120.34",
        "description": "<p align=\"center\"><img src=\"http://cdn.donorschoose.net/images/logos/att_250.gif\"><\/p>\r\n\r\n<p>You can bring this project to life at half the cost!<\/p>\r\n\r\n<p>The AT&T Foundation will fund 50% of this project if someone like you provides the remainder. By completing this project, you will double the impact of your donation.<\/p>\r\n\r\n<p>At AT&T we believe that investing in education is one of the most important things we can do for a strong future. It's an issue that's important to us, our customers and our country.  The support for DonorsChoose.org is part of AT&T Aspire, the company's $350 million commitment to education. AT&T is funding projects at schools that need it most, with the goal of equipping students with the tools necessary to graduate high school and succeed in college, careers and life.<\/p>\r\n\r\n<p><a target=\"_blank\" href=\"../donors/search.html?matchingId=735\">See all projects eligible for this match offer.<\/a><\/p>"
      },
      "teacherFFPromoCodeFund": {
        "eligible": "true",
        "deadline": "March 28",
        "code": "100WOMEN",
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "100Women_small.jpg",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "totalPrice": "240.67",
      "freeShipping": "true",
      "teacherId": "1155963",
      "teacherName": "Mr. Shull",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [],
      "schoolName": "Josiah Quincy Upper School",
      "schoolUrl": "http://www.donorschoose.org/school/josiah-quincy-upper-school/94810/",
      "city": "Boston",
      "zip": "02116",
      "state": "MA",
      "stateFullName": "Massachusetts",
      "latitude": "42.348512000000000",
      "longitude": "-71.069114000000000",
      "zone": {
        "id": "121",
        "name": "Massachusetts"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "16",
        "name": "College &amp; Career Prep",
        "groupId": "5"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-19",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1191329",
      "proposalURL": "http://www.donorschoose.org/project/rap-is-poetry/1191329/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1191329&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2246893_sm.jpg?timestamp=1393364192873",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2246893_thmb.jpg?timestamp=1393364192873",
      "title": "Rap is Poetry",
      "shortDescription": "I have the privilege of teaching a Special Education Behavior Improvement Class (all boys) in a low-income, high minority middle school. My students haven&#039;t yet found poetry that speaks to them....",
      "fulfillmentTrailer": "My students need to read poetry that is meaningful to them. My students know Tupac as a rapper, and I want them to discover that he was also a poet.",
      "snippets": [],
      "synopsis": "I have the privilege of teaching a Special Education Behavior Improvement Class (all boys) in a low-income, high minority middle school. My students haven&#039;t yet found poetry that speaks to them. Tupac writes about the life my students live. His poetry may be the key to unlocking a love of reading. &lt;br/&gt;&lt;br/&gt;My students - almost always male - have a variety of issues that make it difficult for them to behave appropriately. Most of them are angry - at themselves and the world - and see no future for themselves beyond a life on the street. Our area is very low income, with almost no jobs available. The students feel like the requirements of school are totally irrelevant to their lives.  They enjoy rap music, and know Tupac Shakur the rapper. I would like to introduce them to Tupac the poet. Tupac writes about events that are familiar to my students, problems they are living with, and challenges they see every day. I hope that if I can reach the students with a book of poetry about their lives, they will see the benefit of reading other things as well. &lt;br/&gt;&lt;br/&gt;When I receive these books, I will use them as an introduction to a poetry unit.  We will read Tupac&#039;s poems, analyze them, use the poetry to improve our knowledge of figurative language, and write our own poems.  Once the students see that poetry can be relevant and fun to read, we can expand into the more traditional forms of poetry found in standard textbooks. &lt;br/&gt;&lt;br/&gt;Your donations will allow my students to see that there are books and poetry written by and for young African-American men.  Once they realize that education is for people like Tupac, and by extension for people like themselves, I will encourage them to continue to explore other types of literature.  They need hope.  Seeing the positive things that have been accomplished by a rapper may be just the thing to give them that hope for a better future.",
      "percentFunded": "57",
      "numDonors": "43",
      "costToComplete": "123.24",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "285.99",
      "freeShipping": "true",
      "teacherId": "2246893",
      "teacherName": "Ms. Federico",
      "gradeLevel": {
        "id": "3",
        "name": "Grades 6-8"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [
        {
          "id": 9,
          "name": "NEA Member"
        },
        {
          "id": 5,
          "name": "SONIC Teacher"
        }
      ],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 13,
          "name": "CenturyLink"
        },
        {
          "id": 6,
          "name": "Vocational Education"
        }
      ],
      "schoolName": "Avon Park Middle School",
      "schoolUrl": "http://www.donorschoose.org/school/avon-park-middle-school/46281/",
      "city": "Avon Park",
      "zip": "33825-3940",
      "state": "FL",
      "stateFullName": "Florida",
      "latitude": "27.591847000000000",
      "longitude": "-81.501979000000000",
      "zone": {
        "id": "312",
        "name": "Florida"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "1",
        "name": "Books"
      },
      "expirationDate": "2014-06-25",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1198976",
      "proposalURL": "http://www.donorschoose.org/project/today-a-reader-tomorrow-a-leader/1198976/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1198976&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2261203_sm.jpg?timestamp=1394411969925",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2261203_thmb.jpg?timestamp=1394411969925",
      "title": "Today A Reader, Tomorrow A Leader!",
      "shortDescription": "&#034;Readers of good books, particularly books of biography and history, are preparing themselves for leadership. Not all readers become leaders, but all leaders must be readers.&#034; - Harry S Truman I...",
      "fulfillmentTrailer": "My students need book sets for Guided Reading lessons.",
      "snippets": [],
      "synopsis": "&#034;Readers of good books, particularly books of biography and history, are preparing themselves for leadership. Not all readers become leaders, but all leaders must be readers.&#034; - Harry S Truman &lt;br/&gt;&lt;br/&gt;I teach students Kindergarten - Sixth Grade in a self-contained and resource setting in a rural school in Arkansas. All of my students come from high poverty situations and are on free or reduced lunches. The greatest struggle for many of my students can be found in reading. Although I teach up to the Sixth Grade, most of my students read on a First Grade level. However, this doesn&#039;t stifle the drive that my students have to learn. &lt;br/&gt;&lt;br/&gt;We are in desperate need of guided reading book sets. Guided reading is an instructional approach that involves the teacher working with very small groups of students that function on a similar reading level. These texts offer challenges and opportunities for children to think critically. The ultimate goal of guided reading is to move students closer to independent reading. Right now we have very limited access to resources such as book sets. By having these book sets in our classroom, we will be able to devote more time to becoming better readers. &lt;br/&gt;&lt;br/&gt;Most, if not all, of my students are at least two grade levels behind in independent reading ability. With constant access to guided reading book sets, my students will be able to work to bridge their gaps faster.  As a result, they will become more college and career ready.",
      "percentFunded": "65",
      "numDonors": "7",
      "costToComplete": "137.60",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "388.19",
      "freeShipping": "true",
      "teacherId": "2261203",
      "teacherName": "Mrs. Reeves",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 13,
          "name": "CenturyLink"
        }
      ],
      "schoolName": "Arrie Goforth Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/arrie-goforth-elementary-school/47853/",
      "city": "Norfork",
      "zip": "72658-8415",
      "state": "AR",
      "stateFullName": "Arkansas",
      "latitude": "36.196517000000000",
      "longitude": "-92.267621000000000",
      "zone": {
        "id": "324",
        "name": "Arkansas"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "1",
        "name": "Books"
      },
      "expirationDate": "2014-07-09",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1199734",
      "proposalURL": "http://www.donorschoose.org/project/tactful-ly-yours/1199734/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1199734&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2257745_sm.jpg?timestamp=1394477922075",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2257745_thmb.jpg?timestamp=1394477922075",
      "title": "Tactful-ly Yours!",
      "shortDescription": "Imagine trying to learn without wearing your glasses! Many of my students have vision problems which cannot be helped through corrective lenses. They require enlarged print, highlighted text,...",
      "fulfillmentTrailer": "My students need multi-sensory materials such as a triangular pencils, Wikki Stix, highlighter tape, read along classics with CD, social studies readers, and a magnetic easel to learn functional reading and math skills.  These materials will allow me to adapt academics, making them much more meaningful!",
      "snippets": [],
      "synopsis": "Imagine trying to learn without wearing your glasses!  Many of my students have vision problems which cannot be helped through corrective lenses.  They require enlarged print, highlighted text, audio and verbal accompaniment to text materials, and tactile additions. &lt;br/&gt;&lt;br/&gt;Our school is located in the inner city limits serving about 160 students with multiple disabilities. Our students, ages three to twenty-one years, suffer from severe and complicated physical and cognitive disabilities. Serving children beginning at a young age enables teachers, paraprofessionals and therapists to maximize the potential within each child. After completing their education at the Baer School, young adults may go on to an adult day care environment or to a special education high school in the area.  Some students go on to hold a job in a sheltered work environment. \r\nOur school has been around for over 70 years and is a staple in the special education community. School budgets are tighter than ever, so we depend greatly on the generosity of our community neighbors to help meet the needs of our special students. Our students have unique needs that cannot be met by traditional school and district funding. &lt;br/&gt;&lt;br/&gt;These materials will be used for all activities during our Styer-Fitzgerald curriculum work and leisure stations within the classroom.  Students will use Magnetic Scheduling Clocks along with their object/tactile schedule icons to be introduced to time concepts.  Each clock will represent the time an activity is set to start. \r\n \r\nOther materials provide tactile and/or visual cues for students.  Triangular pencils are easier to grasp.  Large, three-dimensional numbers allow tactile exploration, providing more cues to the learner.  Wikki Stix are used to enhance locations on our programmable computer keyboard.  The social studies readers are modified and present bold photographs with simplified language in the text.  Functional community activities, similar to those we participate in each week, are the highlight of the readers.  The other materials requested will add extra visual highlights to our students&#039; work. &lt;br/&gt;&lt;br/&gt;Meeting the needs of each, individual student means modifying all classroom and learning materials.  Each of my students presents with different strengths and needs, yet all benefit from multi-sensorial learning.  Students will &#034;write&#034; shopping lists, identify cost of items, sort vocabulary items by category/group, and enhance literacy skills by listening while viewing the text.  We will also learn community skills which prepares them for the future.",
      "percentFunded": "77",
      "numDonors": "6",
      "costToComplete": "198.09",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "858.39",
      "freeShipping": "true",
      "teacherId": "2257745",
      "teacherName": "Ms. Miller",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "William S Baer School 301",
      "schoolUrl": "http://www.donorschoose.org/school/william-s-baer-school-301/64456/",
      "city": "Baltimore",
      "zip": "21216-3296",
      "state": "MD",
      "stateFullName": "Maryland",
      "latitude": "39.311131000000000",
      "longitude": "-76.656479000000000",
      "zone": {
        "id": "112",
        "name": "Maryland"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-07-10",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1158879",
      "proposalURL": "http://www.donorschoose.org/project/its-not-all-black-and-white/1158879/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1158879&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1477843_sm.jpg?timestamp=1348424729000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1477843_thmb.jpg?timestamp=1348424729000",
      "title": "It&#039;s Not All Black and White",
      "shortDescription": "My students work hard and although many struggle, they are determined to succeed. Imagine having expectations from the city and state but without having the resources and tools to make them a...",
      "fulfillmentTrailer": "My students need iPad minis and protective devices to ensure they will last a lifetime.",
      "snippets": [],
      "synopsis": "My students work hard and although many struggle, they are determined to succeed.  Imagine having expectations from the city and state but without having the resources and tools to make them a reality? Ipads needed! &lt;br/&gt;&lt;br/&gt;My students live in an urban, overpopulated school.  They have limited tools and resources available to access technology readily.  Students have very little experience using technology and many do not have access to the internet, apps, or even computers at home.  Ipads will provide students with all this and more!  In the classroom, it is my mission to use the iPads in a research based manner.  \r\n\r\nMany of my students speak a language other than English at home and many of students have learning disabilities that make the traditional classroom a difficult learning environment and require a more hands-on approach. Despite the challenges that they face, the students in my school are consistently eager to learn and enthusiastic about new and exciting learning opportunities. &lt;br/&gt;&lt;br/&gt;My students respond very well to technology in the classroom, and when implemented appropriately and specifically to their needs it provides students will a wealth of knowledge and ability to check their work with the use of &#034;a robot&#034; so they are constantly self-checking themselves and accountable for their work.   Students are expected to conduct research using technology.  Providing books, simply isn&#039;t enough anymore, and relying on students&#039; to conduct this research at home or in the library limits the majority of your class from being successful because they do not have these resources or means to access technology.  By providing the majority of my students with an iPad, students will either be researching independently or collaborating with the teacher.  This allows for successful research projects by providing unlimited resources for students and additional avenues for them to present their project. &lt;br/&gt;&lt;br/&gt;Help make a difference in the lives of students who are so deserving of the tools that are necessary for them to be successful in our ever-growing technological world.  Impact students&#039; ability to become knowledgable of tools that are helpful in their everyday lives.   Give students not only this opportunity, but exposure to technology they would otherwise not be familiar with. Your generosity will not go unnoticed (no matter how big or small your efforts may be). Help make a difference!",
      "percentFunded": "82",
      "numDonors": "6",
      "costToComplete": "166.86",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "931.27",
      "freeShipping": "false",
      "teacherId": "1477843",
      "teacherName": "Ms. Platt",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 5,
        "name": "SONIC Teacher"
      }],
      "schoolTypes": [{
        "id": 15,
        "name": "Kia (partner)"
      }],
      "schoolName": "PS 89 Elmhurst",
      "schoolUrl": "http://www.donorschoose.org/school/ps-89-elmhurst/909/",
      "city": "Elmhurst",
      "zip": "11373-1434",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.745975000000000",
      "longitude": "-73.879639000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "3",
        "name": "Literature &amp; Writing",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-05-13",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1195131",
      "proposalURL": "http://www.donorschoose.org/project/technology-to-enhance-our-experiences/1195131/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1195131&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1824513_sm.jpg?timestamp=1367014920653",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1824513_thmb.jpg?timestamp=1367014920653",
      "title": "Technology to Enhance Our Experiences",
      "shortDescription": "I am lucky to have twenty two eager students who have a passion to learn. They are a very active group that are soaking up all the skills and information that I can present them with. They are...",
      "fulfillmentTrailer": "My students need an iPad mini to improve literacy during our independent language arts block.",
      "snippets": [],
      "synopsis": "I am lucky to have twenty two eager students who have a passion to learn.  They are a very active group that are soaking up all the skills and information that I can present them with.  They are also intrigued our ever expanding  technical world. &lt;br/&gt;&lt;br/&gt; Our school is located in a small rural community in Michigan. Many of our current students come to us with limited experiences and economical resources. We rely on our wonderful and supportive community to donate supplies, their time and bring experiences to our students.  For example, instead of fall field-trips we have local organizations bring their expertise to our students.\r\nOur first grade classroom of 22 students is all eager to learn. Eighty percent of our class qualifies for free or reduced lunch. Because of the limited income of our students&#039; families, many of them have limited life experiences. The students are highly engaged in technology and are motivated to learn when using computers.  However, they have a hard time waiting for our turn to use the computer lab.  In addition, approximately only 30% of them have access to the technology needed to expand their experiences at home. \r\n &lt;br/&gt;&lt;br/&gt; Teaching with an Apple iPad mini will help me to enhance my instruction and help bring experiences into the classroom to help build students knowledge.  I will utilize the technology training I recently received during a professional development seminar.\r\nDaily use of an Apple iPad mini in the classroom will give students experiences with writing and reading blogs with others.  They will gather and share content across the curriculum.  We can turn our whiteboard into a board where we can record our voice and publish it on the web. This is just a small list of the possibilities.  We can&#039;t wait to get started!\r\n &lt;br/&gt;&lt;br/&gt;Technology is the key to the future.  All donations to our project will help to give my students an unlimited amount of experiences with 21st  century skills that will be needed to be successful in their future educational experiences.",
      "percentFunded": "54",
      "numDonors": "6",
      "costToComplete": "178.52",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "390.52",
      "freeShipping": "false",
      "teacherId": "1824513",
      "teacherName": "Mrs. Smyk",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [{
        "id": 3,
        "name": "Special Education"
      }],
      "schoolName": "Collins Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/collins-elementary-school/72606/",
      "city": "Houghton Lake",
      "zip": "48629",
      "state": "MI",
      "stateFullName": "Michigan",
      "latitude": "44.298131000000000",
      "longitude": "-84.728088000000000",
      "zone": {
        "id": "212",
        "name": "Michigan"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-03",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1158712",
      "proposalURL": "http://www.donorschoose.org/project/connect-a-kid-with-a-kindle/1158712/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1158712&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u204628_sm.jpg?timestamp=1365026490790",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u204628_thmb.jpg?timestamp=1365026490790",
      "title": "Connect a Kid with a Kindle",
      "shortDescription": "&#034;The knowledge that a good book awaits one at the end of a day, makes that a better day.&#034; -Unknown&lt;br /&gt;&lt;br /&gt;Every school day ends with time for SSR. I want all of my students to feel the joy of twenty...",
      "fulfillmentTrailer": "My students need two Kindles as additional resources to engage in the important work of SSR.",
      "snippets": [],
      "synopsis": "&#034;The knowledge that a good book awaits one at the end of a day, makes that a better day.&#034; -Unknown\r\n\r\nEvery school day ends with time for SSR. I want all of my students to feel the joy of twenty minutes of being enveloped in their own little world of reading. &lt;br/&gt;&lt;br/&gt;My eighth grade students are wonderfully diverse and high need. Each of my three classes includes Special Education students, English Language Learners, and striving readers and writers.  Our Kindergarten through 8th grade urban school has a 99% poverty rate. We serve over 600 students, many who have educational and social needs. Despite all of this, our kids come to school everyday ready and willing to learn. &lt;br/&gt;&lt;br/&gt;Each day, twenty minutes is devoted to self-selected reading. Many of my most reluctant readers will do anything to avoid reading during this time. I fully anticipate and expect that the use of carefully selected eBooks via the Kindles will allow these children to access a new world of reading, one in which they can feel successful and lose themselves in the joy of reading. &lt;br/&gt;&lt;br/&gt;The ability to read is fundamental to one&#039;s success in life. I want and need for each of my students to be reading at grade level. The Kindles will be an additional resource to use to reach all of my students.",
      "percentFunded": "61",
      "numDonors": "7",
      "costToComplete": "156.32",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "396.32",
      "freeShipping": "false",
      "teacherId": "204628",
      "teacherName": "Mrs. Wall",
      "gradeLevel": {
        "id": "3",
        "name": "Grades 6-8"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 6,
          "name": "Vocational Education"
        }
      ],
      "schoolName": "Wayne Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/wayne-elementary-school/89707/",
      "city": "Erie",
      "zip": "16503-1524",
      "state": "PA",
      "stateFullName": "Pennsylvania",
      "latitude": "42.136902000000000",
      "longitude": "-80.063232000000000",
      "zone": {
        "id": "113",
        "name": "Pennsylvania"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-04-28",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1186494",
      "proposalURL": "http://www.donorschoose.org/project/color-our-data-with-a-color-printer/1186494/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1186494&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1541617_sm.jpg?timestamp=1347388292000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1541617_thmb.jpg?timestamp=1347388292000",
      "title": "Color our Data with a Color Printer!",
      "shortDescription": "The statistics say approximately half of my students will graduate high school. In my classroom we work hard to combat this stat. &#034;Intelligence is not fixed. Hard work increases intelligence.&#034; My...",
      "fulfillmentTrailer": "My students need a color printer and ink to bring our scientific data to life.",
      "snippets": [],
      "synopsis": "The statistics say approximately half of my students will graduate high school. In my classroom we work hard to combat this stat. &#034;Intelligence is not fixed. Hard work increases intelligence.&#034; My students apply this everyday in my classroom and dream big even when the statistics are not on our side. &lt;br/&gt;&lt;br/&gt;I work in a very under-resourced school district in California. Despite the extra challenges my students face on a daily basis, each comes in with a desire to learn. The classroom is a place where they can be successful and I&#039;d love your help in being able to provide them with all the items they need in order to be successful in the classroom. \r\n\r\nStudents want to learn Biology, but the traditional method of worksheets and notes no longer work. We must continue to revamp our offerings and allow students to learn on their terms through better technological tools. A lack of resources should not be an extra challenge that these students need to face. Our school is determined to fulfill the potential of kids who deserve a quality education. &lt;br/&gt;&lt;br/&gt;My students need a color laser printer. A color laser printer will allow students to be more creative in their development of laboratory reports with enhanced visuals and dynamic looking graphs, charts, and more. Students will also be able to better use colorful resources as reference tools as the teacher can present and give students more colorful visuals to help in their understanding of Biology concepts. &lt;br/&gt;&lt;br/&gt;Color makes such a difference in this world and so can you! No color printers are available to students in the school only black and white. The use of a color laser printer will give students the ability to print better and more colorful visuals and develop projects with a more creative and eye catching view. This printer will open up so many new ways for my students to express themselves. Helping a child learn is priceless!",
      "percentFunded": "59",
      "numDonors": "7",
      "costToComplete": "144.86",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "356.27",
      "freeShipping": "false",
      "teacherId": "1541617",
      "teacherName": "Ms. Morales",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 1,
        "name": "Teach For America"
      }],
      "schoolTypes": [
        {
          "id": 4,
          "name": "Magnet"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 6,
          "name": "Vocational Education"
        }
      ],
      "schoolName": "Skyline Senior High School",
      "schoolUrl": "http://www.donorschoose.org/school/skyline-senior-high-school/3909/",
      "city": "Oakland",
      "zip": "94619-2425",
      "state": "CA",
      "stateFullName": "California",
      "latitude": "37.798384000000000",
      "longitude": "-122.164547000000000",
      "zone": {
        "id": "402",
        "name": "California (North)"
      },
      "subject": {
        "id": "4",
        "name": "Health &amp; Life Science",
        "groupId": "4"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-06-18",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1163744",
      "proposalURL": "http://www.donorschoose.org/project/cozy-classroom/1163744/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1163744&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1797798_sm.jpg?timestamp=1372884003519",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1797798_thmb.jpg?timestamp=1372884003519",
      "title": "Cozy Classroom",
      "shortDescription": "Every day I begin the day with &#034;Good Morning Friends,&#034; and they sign or say &#034;Good Morning Teacher.&#034; I would like my students to become more responsible for their own actions and what they are...",
      "fulfillmentTrailer": "My students need a quiet area in the room to relax and read. They need headphones for the computers and radio. They also need a comfy chair to sit on in the quiet corner and a carpet.",
      "snippets": [],
      "synopsis": "Every day I begin the day with &#034;Good Morning Friends,&#034; and they sign or say &#034;Good Morning Teacher.&#034;  I would like my students to become more responsible for their own actions and what they are capable of doing on their own. &#034;Nothing is impossible. The word itself says I&#039;m possible&#034; said Audrey Hepburn. &lt;br/&gt;&lt;br/&gt;My students face many challenges on a daily basis. They all have an Intellectual Disability, which was formerly Mental Retardation. They all are living below the poverty  level, and many are sick due to their diagnosis. This does not stop them. They come in my class every day asking for work, and asking to help out in any way that they can. They know what is expected of them, and they accept responsibility for their actions. They do not notice that the school has little to no money. \r\nThe school is located in an urban area. This school is also a Title I school. This means that &#034;..this title is to ensure that all children have a fair, equal, and significant opportunity to obtain a high-quality education and reach, at a minimum, proficiency on challenging State academic achievement standards and state academic assessments.&#034; This school was also impacted tremendously by the recent budget crisis in the state of Pennsylvania. &lt;br/&gt;&lt;br/&gt;I have requested a few things to make certain areas distraction free. The divider can be placed next to the computers so the others may focus on the teacher. I only have outlets on one side of the room, so I am very limited in the placement of computers and other electronics. \r\n\r\nThe headphones can be used on the computers and on the radio to listen to books on tape. The headphones can drown out the noise that is around them so they can focus on the educational, curriculum enhancement Internet or computer games. \r\n\r\nThe comfy chairs would be just that. I would like to make the reading corner more inviting. I have a few small pillows, but I need more so that they want to sit down and read a book or look through pictures. \r\n\r\nThe carpet would be used to help block out more noise. The classroom is old and has titles on the floor. This makes it loud and very distracting. The carpet would help absorb some of the sounds and allow for more comfort. &lt;br/&gt;&lt;br/&gt;This project will help make my class more inviting.  These students do not have much at home, so I would at least like to be able to provide it for them at school. School, for some of my students, is the safest and most inviting place they see every day of every week. These items would provide a warm and safe environment.",
      "percentFunded": "68",
      "numDonors": "7",
      "costToComplete": "145.78",
      "completedMatching": {
        "matchingKey": "DISNEYP14",
        "name": "Disney",
        "type": "PROMO",
        "logoURL": "http://cdn.donorschoose.net/images/logos/disney_small.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=DISNEYP14",
        "amount": "0.00",
        "completed": "true",
        "description": "<p>Disney is amplifying the impact of teachers who rally support for their classroom projects. Any teacher who posts a new project has seven days to inspire friends and family to donate to their classrooms, and Disney will match that generosity. <a target=\"_blank\" href=\"http://help.donorschoose.org/app/answers/detail/a_id/405\">Details for teachers<\/a>.<\/p>\r\n\r\n<p>About Disney:<br>We believe that if you can dream it, you can do it. Our goal is to motivate generations of kids to harness the power of creativity to help improve their communities. The world's next great artists, innovators, athletes, engineers, architects, zoologists and dreamers are out there. Disney is thrilled to play a role in supporting teachers while providing kids with the tools they need to learn, thrive and create the future they imagine. By inspiring creativity in young people today, we hope to ignite the spark of innovation that will lead us all to a brighter tomorrow. Learn more about <a target=\"_blank\" href=\"http://www.thewaltdisneycompany.com/citizenship\">Disney's Citizenship efforts<\/a>.<\/p>"
      },
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "450.78",
      "freeShipping": "true",
      "teacherId": "1797798",
      "teacherName": "Mrs. Kramer",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "Martha Washington Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/martha-washington-elementary-school/90730/",
      "city": "Philadelphia",
      "zip": "19104-1398",
      "state": "PA",
      "stateFullName": "Pennsylvania",
      "latitude": "39.966241000000000",
      "longitude": "-75.211222000000000",
      "zone": {
        "id": "113",
        "name": "Pennsylvania"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-05-07",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1166290",
      "proposalURL": "http://www.donorschoose.org/project/super-students-need-a-break-part-2/1166290/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1166290&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1944654_sm.jpg?timestamp=1386963039833",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1944654_thmb.jpg?timestamp=1386963039833",
      "title": "Super Students Need A Break: Part 2",
      "shortDescription": "My students are in desperate need of a cozy break spot in our room! We are on our way with a new carpet and bean bag chairs and with a little help from you, 2 room dividers will define this area...",
      "fulfillmentTrailer": "My students need 2 room dividers for our sensory break spot.",
      "snippets": [],
      "synopsis": "My students are in desperate need of a cozy break spot in our room! We are on our way with a new carpet and bean bag chairs and with a little help from you, 2 room dividers will define this area and my students will have a spot to take a sensory break. &lt;br/&gt;&lt;br/&gt;I am a first year special education teacher working in an inner city school district. My school is a Title I school with approximately 1,100 students in PK-8th grade. I teach eight students with Autism in a self-contained classroom, grades 4-7. My students have a wide range of abilities academically, socially, and in communication. I have three students who are nonverbal, communicating with pictures and/or speech generating devices. &lt;br/&gt;&lt;br/&gt;All of my students have sensory impairments. They get over stimulated by noise and lights and get easily frustrated throughout the day. It is important for them to have a safe sensory spot in our room where they can take a sensory break. We currently have a spot where they can go and sit on a beanbag and use a sensory tool such as a pressure vest or weighted blanket and receive some much needed sensory input. Although we have the physical space, a new carpet and beanbag chairs, our spot is not clearly defined or private. Two room dividers will complete our break area. The spot will be clearly defined and it will also be a spot where the students can have a few private moments to take a break and become regulated and ready to return to classroom lessons. &lt;br/&gt;&lt;br/&gt;Everyone benefits from a break at some point during their day. My students need these breaks more frequently than the average student. Won&#039;t you please help complete our break area with 2 classroom dividers and give my students a spot to take a much needed break?",
      "percentFunded": "43",
      "numDonors": "4",
      "costToComplete": "197.14",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "343.38",
      "freeShipping": "true",
      "teacherId": "1944654",
      "teacherName": "Mr. Valentino",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [],
      "schoolName": "Cesar A Batalla School",
      "schoolUrl": "http://www.donorschoose.org/school/cesar-a-batalla-school/43417/",
      "city": "Bridgeport",
      "zip": "06605-2016",
      "state": "CT",
      "stateFullName": "Connecticut",
      "latitude": "41.170125000000000",
      "longitude": "-73.208586000000000",
      "zone": {
        "id": "101",
        "name": "Connecticut"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "6",
        "name": "Other"
      },
      "expirationDate": "2014-05-11",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1187055",
      "proposalURL": "http://www.donorschoose.org/project/tick-tock-tick-tock-time-is-of-the-esse/1187055/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1187055&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1511835_sm.jpg?timestamp=1374805881729",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1511835_thmb.jpg?timestamp=1374805881729",
      "title": "Tick-Tock-Tick-Tock: Time Is of the Essence!",
      "shortDescription": "If you stepped into our classroom on any given day, you&#039;d see a loud, busy mess of learning happening. We often become so engaged in learning activities that the time flies right by! We lose track...",
      "fulfillmentTrailer": "My students need classroom timers in a variety of sizes to help them prepare for transitions between classes and maximize learning time.",
      "snippets": [],
      "synopsis": "If you stepped into our classroom on any given day, you&#039;d see a loud, busy mess of learning happening. We often become so engaged in learning activities that the time flies right by! We lose track of time, and before we know it the day has passed and we have not met our learning goals. &lt;br/&gt;&lt;br/&gt;The eleven students in my classroom are hard working and excited to learn. They love coming to school each day, and enjoy the social and academic aspects of school. All of my students have cognitive and intellectual disabilities. Each child has unique learning challenges and specific needs to be met. They require unique support services, and with that comes unique joy and happiness in learning. My students feel proud and accomplished when they complete a new task, and it&#039;s my goal to give them more experiences that boost their confidence and build their stamina for learning. My students attend school in a big, urban district that leaves limited funding for special education programs. My students are often overlooked and their day to day needs are lost in such a big school system. We have so many varied needs in our classroom, it&#039;s nearly impossible for them to be funded by our school system. &lt;br/&gt;&lt;br/&gt;Your donations will provide us with a variety of visual timers for our classroom. They will be used to maximize our time on task during the school day. My students and I get so engaged in learning tasks that at times, we completely forget to check the clock. Keeping on track is essential in order for us to learn about new, exciting, and essential topics! In whole group lessons, I will use the timer to keep track of my teaching, as well as time student-input sessions. During small group lessons, students and paraprofessionals will use the visual clocks to keep their group on task, so we can rotate through stations effectively. During independent time, students will use the visual timers to self-monitor the completion of their work. The variety of timers will not only be used to keep us on track as a whole group, but students will also learn valuable time management skills and begin to take ownership of their learning! &lt;br/&gt;&lt;br/&gt;Staying on track is an essential component to teaching and learning. Your donation will be meeting a simple, day to day need in our classroom. Visual timers in a variety of sizes will help us stay on track during all times of our day!",
      "percentFunded": "54",
      "numDonors": "5",
      "costToComplete": "123.07",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "268.07",
      "freeShipping": "true",
      "teacherId": "1511835",
      "teacherName": "Ms. Claxton",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 4,
          "name": "Magnet"
        },
        {
          "id": 3,
          "name": "Special Education"
        }
      ],
      "schoolName": "Mccutcheon Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/mccutcheon-elementary-school/5742/",
      "city": "Chicago",
      "zip": "60640-3717",
      "state": "IL",
      "stateFullName": "Illinois",
      "latitude": "41.970814000000000",
      "longitude": "-87.654660000000000",
      "zone": {
        "id": "201",
        "name": "Illinois (Chicago)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-03-31",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1191824",
      "proposalURL": "http://www.donorschoose.org/project/make-sitting-in-class-a-fun-activity/1191824/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1191824&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1126808_sm.jpg?timestamp=1393552673677",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1126808_thmb.jpg?timestamp=1393552673677",
      "title": "Make Sitting in Class a Fun Activity!",
      "shortDescription": "Have you ever gotten tired of sitting in your chair at your desk? Although we do Kinesthetic activities in class to learn, we do spend a lot of time in our chairs and it is hard for some of my...",
      "fulfillmentTrailer": "My students need 2 exercise ball chairs to make sitting in class easier.",
      "snippets": [],
      "synopsis": "Have you ever gotten tired of sitting in your chair at your desk? Although we do Kinesthetic activities in class to learn, we do spend a lot of time in our chairs and it is hard for some of my students. &lt;br/&gt;&lt;br/&gt;I am a teacher in a 6:1:1 classroom in a middle school for students with special needs. We have adopted the TEACCH method in our classroom. The students have a variety of learning methods which we emphasize in the class, through setting up different areas in the classroom. \r\n\r\n &lt;br/&gt;&lt;br/&gt;The chairs will be used in class as opposed to the hard metal chairs that we currently use. The students will recieve more comfort and less stress on their backs, which will hopefully lead to a more happy learning environment. I envision that just like the current chairs, these chairs can be used in all our classroom areas. &lt;br/&gt;&lt;br/&gt;My students will have the oportunity to sit on the exercise ball chairs to help them with their sensory input. The castors will help us move the chairs without making loud noises or scratching the floor, which are also taxing on the students&#039; senses.",
      "percentFunded": "40",
      "numDonors": "5",
      "costToComplete": "169.40",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "284.40",
      "freeShipping": "false",
      "teacherId": "1126808",
      "teacherName": "Mr. McKeon",
      "gradeLevel": {
        "id": "3",
        "name": "Grades 6-8"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 5,
          "name": "Year Round"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "P053K @ 088K",
      "schoolUrl": "http://www.donorschoose.org/school/p053k---088k/98761/",
      "city": "Brooklyn",
      "zip": "11215",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.660793000000000",
      "longitude": "-73.988731000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "6",
        "name": "Other"
      },
      "expirationDate": "2014-06-26",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1200878",
      "proposalURL": "http://www.donorschoose.org/project/experiential-learning-making-an-icosahe/1200878/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1200878&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1513626_sm.jpg?timestamp=1394579115185",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1513626_thmb.jpg?timestamp=1394579115185",
      "title": "Experiential Learning- Making an Icosahedron",
      "shortDescription": "My students are visual and kinesthetic learners that desperately desire to comprehend the math around them. When they learn through experience, they are at their sharpest. I strive to meet them...",
      "fulfillmentTrailer": "My students need straws and multi-colored ribbons to create icosahedrons to visually comprehend geometric shapes and concepts.",
      "snippets": [],
      "synopsis": "My students are visual and kinesthetic learners that desperately desire to comprehend the math around them. When they learn through experience, they are at their sharpest. I strive to meet them where they are and get them where they need to be so they can succeed. &lt;br/&gt;&lt;br/&gt;I teach in an urban school in Oklahoma in a special education math classroom. I  teach both 7th and 8th graders from all different ethnic backgrounds; however, the majority of my kids live in poverty.\r\n\r\nMy students are wonderful learners who struggle with conceptual math. However, once a math concept is made concrete through visual or kinesthetic means, my students shine. Throughout this school, I have consistently become more and more proud of my kids. At the start of the year, they were timid and afraid of getting incorrect answers. Now, they know and feel comfortable with trying again until they get the right answer- no matter how many times it takes. Now, they won&#039;t let me help them until they&#039;ve tried the problems a few times on their own! My students have learned to be confident in themselves and work hard to understand every new concept i present them with. &lt;br/&gt;&lt;br/&gt;My students will use the straws and ribbons to create icosahedrons, which are 3d figures with 20 faces formed most from equilateral triangles. We will take two days, one where we create the base of our figure and the second day where we put in all of the points of our star-like shape. \r\n\r\nThis project is fitting in with our geometry unit, where we look at nets of 3d shapes, and calculate surface area and volume of 3d figures. This project will give my students practice in calculating the surface area of a complex 3d object, and help them understand that bigger, complex figures are made up of smaller, simpler figures. \r\n\r\nI am passionate about this project, because I know my kids are experiential learners, and giving them the chance to both create and analyze a product is so much better for them than me giving them worksheets or even having them analyze nets of shapes. Plus, at the end of the project, they have a product that they can be proud of. &lt;br/&gt;&lt;br/&gt;Donations to this project would help further my kids understanding and internalizing the concepts of geometry. Beyond the long-term comprehension and a wonderful boost to help prepare for end of year testing, this is a very fun project that kids love and can proud of. Since project-based learning is more engaging, this also leaves students with a positive view on learning and makes them more excited to come into class the next day and learn more.",
      "percentFunded": "72",
      "numDonors": "1",
      "costToComplete": "63.79",
      "matchingFund": {
        "matchingKey": "ARES14",
        "name": "Ares Management",
        "type": "DYI",
        "logoURL": "http://cdn.donorschoose.net/images/logos/ares_135.gif",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=ARES14",
        "amount": "113.79",
        "description": "<p align=\"center\"><img src=\"http://cdn.donorschoose.net/images/logos/ares_250.gif\"><\/p>\r\n\r\n<p>You can bring this project to life at half the cost!<\/p>\r\n\r\n<p>Ares Management LLC will fund 50% of this project if someone like you provides the remainder. By completing this project, you will double the impact of your donation.<\/p>\r\n\r\n<p>Ares Management LLC is dedicated to inspiring and enriching youth with the education and support needed to achieve academic excellence. Through its Ares In Motion program (\"A.I.M.\"), Ares Management LLC has proudly partnered with DonorsChoose.org to fund projects focused on mathematics and financial literacy across the U.S. and to support educators devoted to making a difference in the lives of deserving students.<\/p>\r\n\r\n<p><a target=\"_blank\" href=\"../donors/search.html?matchingId=697\">See all projects eligible for this match offer.<\/a><\/p>"
      },
      "totalPrice": "227.58",
      "freeShipping": "true",
      "teacherId": "1513626",
      "teacherName": "Ms. Bixler",
      "gradeLevel": {
        "id": "3",
        "name": "Grades 6-8"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [
        {
          "id": 1,
          "name": "Teach For America"
        },
        {
          "id": 9,
          "name": "NEA Member"
        }
      ],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "Hale Junior High School",
      "schoolUrl": "http://www.donorschoose.org/school/whitney-middle-school/87477/",
      "city": "Tulsa",
      "zip": "74129-2007",
      "state": "OK",
      "stateFullName": "Oklahoma",
      "latitude": "36.132114000000000",
      "longitude": "-95.899881000000000",
      "zone": {
        "id": "323",
        "name": "Oklahoma"
      },
      "subject": {
        "id": "8",
        "name": "Mathematics",
        "groupId": "4"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-04-11",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1203895",
      "proposalURL": "http://www.donorschoose.org/project/finding-the-resources-they-deserve-and/1203895/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1203895&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u576976_sm.jpg?timestamp=1369102859411",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u576976_thmb.jpg?timestamp=1369102859411",
      "title": "Finding the resources, they deserve and need...",
      "shortDescription": "I work in a new high school in Philadelphia. It has been a challenging year for us, due to a lack in our resources. The students I teach came from two neighborhood schools that were forced to...",
      "fulfillmentTrailer": "My students need just about everything.  We are a new high school and are starting from scratch.  We need paper, markers, rulers, glue sticks &amp; books, to name a few...",
      "snippets": [],
      "synopsis": "I work in a new high school in Philadelphia.  It has been a challenging year for us, due to a lack in our resources.  The students I teach came from two neighborhood schools that were forced to close last year.  It has been a difficult move for them but we are doing the best we can to make it work. &lt;br/&gt;&lt;br/&gt;My students have always been told that they are not good enough, and so their schools last year were shut down.  We are still without textbooks in my class and many of my students have had to switch high schools more than three times.  This is sad to me, and all I want to do is to show them that when they try hard at something, good things will come their way.  My students are very spirited individuals and put forth effort when they feel that they can be successful.  I truly believe that if I can provide them with the resources that they need to do well, then they will rise up and come out on top.  I am asking that you support them in meeting this goal.  I have ordered a book for each one to create a journal of their likes and dislikes using the target language in my Spanish class for a grade, and then to keep forever.  Please be a part of doing something special and worthwhile for my students, so that they may know that just because they may not be rich, they are worth it &amp; deserving. &lt;br/&gt;&lt;br/&gt;My students will be so excited to receive the following materials; these items will truly enhance learning in my classroom each and every day. My students will love having a new box of colored pencils, glue sticks and markers to use when creating projects in class.  They will use the class set of rulers and erasers to keep their work neat and organized, and the mobile organizer to keep their classwork in, from one day to the next.  The journals that you give them will allow each the opportunity to create a book that they can treasure forever.  The Atlas books will be added to our classes&#039; library after students use them to discover and extract information from for their country research projects and the apple timer will help to make transitioning from one topic to the next, a bit easier.  The paper collage kit is awesome and will encourage creativity.   I could never do this without you and I thank you for helping me to give my students what they really deserve and need to succeed. &lt;br/&gt;&lt;br/&gt;You are giving my students so many amazing things and I truly appreciate your generosity. Your donations will make my classroom feel like a real room.  Right now it is missing many of the staples that a real room requires.  You will fill in the missing parts, and then my students will have everything that they need to do well.",
      "percentFunded": "83",
      "numDonors": "1",
      "costToComplete": "96.23",
      "matchingFund": {
        "matchingKey": "ATT14",
        "name": "AT&amp;T Foundation",
        "type": "DYI",
        "logoURL": "http://cdn.donorschoose.net/images/logos/att_135.gif",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=ATT14",
        "amount": "276.22",
        "description": "<p align=\"center\"><img src=\"http://cdn.donorschoose.net/images/logos/att_250.gif\"><\/p>\r\n\r\n<p>You can bring this project to life at half the cost!<\/p>\r\n\r\n<p>The AT&T Foundation will fund 50% of this project if someone like you provides the remainder. By completing this project, you will double the impact of your donation.<\/p>\r\n\r\n<p>At AT&T we believe that investing in education is one of the most important things we can do for a strong future. It's an issue that's important to us, our customers and our country.  The support for DonorsChoose.org is part of AT&T Aspire, the company's $350 million commitment to education. AT&T is funding projects at schools that need it most, with the goal of equipping students with the tools necessary to graduate high school and succeed in college, careers and life.<\/p>\r\n\r\n<p><a target=\"_blank\" href=\"../donors/search.html?matchingId=735\">See all projects eligible for this match offer.<\/a><\/p>"
      },
      "teacherFFPromoCodeFund": {
        "eligible": "true",
        "deadline": "March 27",
        "code": "INSPIRE",
        "matchingKey": "teacherProm5",
        "name": "Matching Donor",
        "type": "PROMO",
        "logoURL": "",
        "description": ""
      },
      "totalPrice": "552.45",
      "freeShipping": "false",
      "teacherId": "576976",
      "teacherName": "Ms. Philips &amp; hardworking travelers",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [{
        "id": 5,
        "name": "Year Round"
      }],
      "schoolName": "Penn Treaty School",
      "schoolUrl": "http://www.donorschoose.org/school/penn-treaty-middle-school/90835/",
      "city": "Philadelphia",
      "zip": "19125-3492",
      "state": "PA",
      "stateFullName": "Pennsylvania",
      "latitude": "39.972742000000000",
      "longitude": "-75.127672000000000",
      "zone": {
        "id": "113",
        "name": "Pennsylvania"
      },
      "subject": {
        "id": "22",
        "name": "Foreign Languages",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-07-18",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1206861",
      "proposalURL": "http://www.donorschoose.org/project/supplies-to-support-our-new-technology/1206861/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1206861&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1568423_sm.jpg?timestamp=1385312164946",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1568423_thmb.jpg?timestamp=1385312164946",
      "title": "Supplies to Support Our New Technology!",
      "shortDescription": "My students were blessed with wondrous new technology this year, such as a Prometheus Interactive Whiteboard, and new Apple Macbook Air. Their use, however, is limited by what was missing from the...",
      "fulfillmentTrailer": "My students need a case, VGA adapter, CD drive and speakers to go with our new technology!",
      "snippets": [],
      "synopsis": "My students were blessed with wondrous new technology this year, such as a Prometheus Interactive Whiteboard, and new Apple Macbook Air.  Their use, however, is limited by what was missing from the boxes! Help us use our items to their fullest potential with the addition of these new tools! &lt;br/&gt;&lt;br/&gt;My students are AMAZING. They are high schoolers empowered to do their best, but are limited by their intellectual, or multiple disabilities. My class is enrolled in a NYC Specialized School in a high poverty area of the South Bronx. They face cognitive, physical, and emotional challenges that many of us will never have to encounter, everyday. They are brave, resilient, eager to learn, and come to school with a positive attitude each and every day.\r\n\r\nWe have done a lot this year to ensure that the needs of my students are met by classroom tools. To foster engagement, an interactive whiteboard was installed; for deficits in handwriting, a new computer and speech-to-text software.  Now, after initiating the use of these new products, we&#039;re realizing needs are still not best met. &lt;br/&gt;&lt;br/&gt;Without speakers, our interactive whiteboard limits volume produced by the interactive lessons I teach.  This often causes students to lose focus quickly, as they cannot appropriately attend to the listening tasks.  The addition of speakers will truly enhance the experience for my students and encourage greater participation and understanding of content.\r\n\r\nWhen we received our new Macbook Air and Dragon Dictation software, we realized we had a problem! We couldn&#039;t install the software without a CD drive!  In addition to Dragon, our class has been provided with other software programs that truly enhance learning experiences for students with disabilities.  We cannot install these without the Apple USB Superdrive!\r\n\r\nWouldn&#039;t it be wonderful to use our new pieces of technology together?! Unfortunately, we cannot connect our new laptop to our new whiteboard without the Apple VGA Adapter!\r\n\r\nLastly, we need to ensure our new laptop is protected with a case as we seek to use it quite frequently! &lt;br/&gt;&lt;br/&gt;Wouldn&#039;t you want the best education possible? These supplies will not only enhance the classroom environment, but increase attention span and foster the highest levels of engagement. With the necessary supplies to make our new technology work, we can really bring lessons to life for these students who require multiple means of representation to grasp concepts. Thank you so much in advance!",
      "percentFunded": "61",
      "numDonors": "1",
      "costToComplete": "82.47",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "teacherFFPromoCodeFund": {
        "eligible": "true",
        "deadline": "March 29",
        "code": "100WOMEN",
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "100Women_small.jpg",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "totalPrice": "212.47",
      "freeShipping": "true",
      "teacherId": "1568423",
      "teacherName": "Ms. Fargnoli",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 5,
        "name": "SONIC Teacher"
      }],
      "schoolTypes": [{
        "id": 5,
        "name": "Year Round"
      }],
      "schoolName": "PS X811",
      "schoolUrl": "http://www.donorschoose.org/school/ps-811x-bronx--center-multi-hndcp/453/",
      "city": "Bronx",
      "zip": "10459",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.830528259277344",
      "longitude": "-73.886787414550781",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-22",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1195101",
      "proposalURL": "http://www.donorschoose.org/project/connect-across-disciplines/1195101/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1195101&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2190290_sm.jpg?timestamp=1389804545633",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2190290_thmb.jpg?timestamp=1389804545633",
      "title": "Connect Across Disciplines",
      "shortDescription": "Manipulatives are tools that let children think, perform, problem-solve, and make things happen while they are working toward a solution. It provides an important step in the evolution of children...",
      "fulfillmentTrailer": "My students need books to help aide reading, flashcards for centers and drills, iPad cases to protect theirs for years to come, and a tie-up shoe for occupational skills.",
      "snippets": [],
      "synopsis": "Manipulatives are tools that let children think, perform, problem-solve, and make things happen while they are working toward a solution. It provides an important step in the evolution of children developmental skills and learning values. &lt;br/&gt;&lt;br/&gt;I have the pleasure of teaching an inclusion classroom that contains students with mild to severe special needs. Inclusion is an approach to educate students with special needs. Under the inclusion model, students with special needs spend most, or all of their time, with non-disabled students. My students come from a low income, usually one parent household with many siblings. However, they are the most loving and caring group of students. I look forward coming to work to be able to teach them and enhance their abilities so that in the future they are able to strive in today&#039;s society. Our school is one of three elementary schools in the district. It consists of pre-kindergarten through fifth grade classes. Each grade has anywhere from 100-120 students, all from the same socioeconomic background. The teachers travel from within the same city to up to 90 minutes away to work here. &lt;br/&gt;&lt;br/&gt;We know that students need to be engaged to appreciate and learn what is being taught. My students need materials for both math and language arts. They need Write and Wipe Fact Family Boards, Subtraction Wrap-up Keys, and Minute Math Electronic Flash Cards. These materials will help master difficult math skills that need to be memorized and drilled. They need a Tie-Up Shoe to develop occupational skills. For our Language Arts curriculum, the students would benefit from Photo Language Cards for Rhymes, Opposites, Word Families, Blends and Digraphs. Students, especially ELL learners, are continuing to struggle with Reading. That is why I am also asking for a Book Set to help engage beginners to want to read especially when what they are reading is fun and interesting to them. We have recently added iPads to our classroom. Unfortunately, we need cases to protect them so that students in further years will be able to enjoy the creativity and hands-on learning experience. &lt;br/&gt;&lt;br/&gt;Teachers who use a hands on activities see an increase in student engagement, knowledge retention, and learner independence. Teachers who see these results want to keep that spark alive in their students. That is why I want to afford my students new opportunities to learn in every way possible. Incorporating hands-on learning into every classroom lesson helps students grasp and retain concepts with greater ease. It also makes the entire teaching process most effective.",
      "percentFunded": "74",
      "numDonors": "1",
      "costToComplete": "97.00",
      "matchingFund": {
        "matchingKey": "CFNJ14",
        "name": "The Community Foundation of New Jersey",
        "type": "ALMOST_HOME",
        "logoURL": "http://cdn.donorschoose.net/images/logos/cfnj_135.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=CFNJ14",
        "amount": "295.53",
        "description": "<p align=\"center\"><img src=\"http://www.donorschoose.org/images/logos/cfnj_250.jpg\"><\/p><p>You can bring this project to life for less than $100!<\/p>\r\n\r\n<p>Thanks to funding from the Community Foundation of New Jersey, this project is \"Almost Home!\" The Community Foundation of New Jersey will fund most of this project if someone like you provides the remainder. By completing this project you will leverage the impact of your donation.<\/p>\r\n\r\n<a target=\"_blank\" href=\"../donors/search.html?matchingId=615\">See all projects eligible for this Double Your Impact offer.<\/a><\/p>\r\n\r\n<p>Established in 1979, the Community Foundation of New Jersey is an alliance of families, businesses and foundations that work together to create lasting differences in people's lives and communities.  Our mission is to support charitable giving that is inspired by our donors, targeted at making our communities stronger, driven by creative solutions, and effective in achieving lasting change. We have a network of affiliates in Newark, Mercer, Monmouth and Morris Counties, and in South Jersey.  Through a combination of Legacy Funds and Donor Advised Funds, the foundation has granted an average of more than $25 million each year to charitable organizations and currently stewards over $250 million in charitable assets for current needs and future challenges.<\/p>"
      },
      "totalPrice": "442.53",
      "freeShipping": "false",
      "teacherId": "2190290",
      "teacherName": "Ms. Lachnicht",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [{
        "id": 3,
        "name": "Special Education"
      }],
      "schoolName": "Columbus School",
      "schoolUrl": "http://www.donorschoose.org/school/columbus-school/81491/",
      "city": "Carteret",
      "zip": "07008-2575",
      "state": "NJ",
      "stateFullName": "New Jersey",
      "latitude": "40.573419000000000",
      "longitude": "-74.221309000000000",
      "zone": {
        "id": "102",
        "name": "New Jersey"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "3",
        "name": "Literature &amp; Writing",
        "groupId": "6"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-07-05",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1176568",
      "proposalURL": "http://www.donorschoose.org/project/appetizing-learning-choices/1176568/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1176568&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2212402_sm.jpg?timestamp=1391024736425",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2212402_thmb.jpg?timestamp=1391024736425",
      "title": "APPetizing Learning Choices",
      "shortDescription": "Imagine walking into a first grade classroom of 24 eager, energetic, ready to learn boys and girls all with different interests, experiences, and levels of learning. The problem is that their...",
      "fulfillmentTrailer": "My students need one iPad and a variety of nonfiction and leveled books to choose from to improve literacy, writing skills, and individual social and learning goals.",
      "snippets": [],
      "synopsis": "Imagine walking into a first grade classroom of 24 eager, energetic, ready to learn boys and girls all with different interests, experiences, and levels of learning.  The problem is that their differences can&#039;t be met because their classroom lacks the materials and technology that they need. &lt;br/&gt;&lt;br/&gt;Our school is located in a very rural, high poverty area, where students lack experiences needed to be successful with their learning goals. The use of individualized choice boards, nonfiction books, leveled books, and small group instruction will help keep them motivated and meeting their goals.   I have come to the conclusion that in order for this group of kids to grow academically, I am going to have to individualized their instruction.  I am using small group and individualized instruction time to meet their needs.  During the time that I am working with these students, all of the other students will be busy completing their individualized learning plans using choice boards.  The boards will allow students to choose assignments from their appetizer, main course, and dessert menus.  These assignments will be strategically placed to meet their individual needs.  I plan on using the materials purchased with this grant to implement this type of differentiated instruction. &lt;br/&gt;&lt;br/&gt;My first grade class has been a very challenging group.  It consists of twelve boys and twelve girls.  I also have a wide range of skill and interest levels.  My class is very active, but interested in learning.  I want to continue to keep them motivated in learning and meeting their learning goals this year.  Therefore, I want to implement small group and individualized instruction in my classroom.  The problem is that I lack the materials that I need to meet their needs.  I will be using choice boards to help differentiate instruction during this time.  This will allow me to help each student build an individualized plan for his/her learning.  The choices on this board will include the use of the nonfiction books and iPad included in this grant.  Students will be able to choose to use these materials individually or with small groups in order to meet their learning goals. &lt;br/&gt;&lt;br/&gt;I found that this year&#039;s students are very interested in learning about animals.  We will use the nonfiction books to learn more about these animals.  We will also be completing animal research using these books as well.  The iPad will allow students to learn to use this new technology and provide many different digital learning experiences.",
      "percentFunded": "69",
      "numDonors": "9",
      "costToComplete": "289.94",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "924.94",
      "freeShipping": "false",
      "teacherId": "2212402",
      "teacherName": "Mrs. James",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        }
      ],
      "schoolName": "Scranton Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/scranton-elementary-school/6166/",
      "city": "Scranton",
      "zip": "29591",
      "state": "SC",
      "stateFullName": "South Carolina",
      "latitude": "33.910530021468475",
      "longitude": "-79.747444597992981",
      "zone": {
        "id": "303",
        "name": "South Carolina"
      },
      "subject": {
        "id": "3",
        "name": "Literature &amp; Writing",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "1",
        "name": "Books"
      },
      "expirationDate": "2014-05-29",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1166478",
      "proposalURL": "http://www.donorschoose.org/project/i-want-to-increase-my-students-reading/1166478/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1166478&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2192969_sm.jpg?timestamp=1389549965426",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2192969_thmb.jpg?timestamp=1389549965426",
      "title": "I Want to Increase My Students&#039; Reading Fluency!",
      "shortDescription": "I want my students to be reading 1-2 years better than their current starting point of 4-5 years behind their grade level peers. I teach students with academic learning disabilities. They are in...",
      "fulfillmentTrailer": "My students need a comfortable place to listen to their paperback audio library to increase their current phonics skills.  They need the audio and books to hear good reading.",
      "snippets": [],
      "synopsis": "I want my students to be reading 1-2 years better than their current starting point of 4-5 years behind their grade level peers.  &lt;br/&gt;&lt;br/&gt;I teach students with academic learning disabilities.  They are in grades 4-8th, in a multilevel classroom.  I have one and a half adults to help me accomplish their learning goals.  My students have great attendance and are learning to thrive in spite of their learning differences. They love working on anything computerized or audio typed.  They typically have better comprehension than their reading skills.  They work hard to build their background comprehension to improve their reading skills.  \r\n\r\nMy school has almost 700 students from Pre-K to Eighth grade.  We are 50% ELL and have a free and reduced lunch rate of 85% or higher.  My classroom is a Citywide Special Education Program for students who receive more than 60% of their day in my classroom.  We are located in Minneapolis, MN. \r\n\r\nMy students are hands-on learners! They love to draw, make and act out what they learn.  They are active in our after school program and have a desire to be successful in the mainstream.  &lt;br/&gt;&lt;br/&gt;I have tried to create a nice reading area in my classroom.  I will use the pillows for the students to sit on while reading independently or listening to the audiobooks (paperback library) provided by the newly implemented reading intervention program.  The students are progressing through the computer program at their own pace so all students are at different levels. My students will be able to have a choice of which book they listen to during independent reading time. \r\n\r\nThe paperback library has an audio component that has been difficult for the students to access.  I currently have enough computers for each student to complete their daily instruction but not enough time for them to listen to the e-books component.  I have one CD player for the students (4-5 students at a time) to share during independent reading time.  Having another CD player with headphones will allow for two choices and different skill levels to be addressed.  &lt;br/&gt;&lt;br/&gt;Receiving this donation will allow my students to increase their reading fluency, decoding and comprehension.  This donation will allow my students to improve their reading levels one to two grade levels.  \r\n\r\nThis donation will enable more opportunity for my students to hear good reading fluency, and improve their own reading fluency!",
      "percentFunded": "73",
      "numDonors": "11",
      "costToComplete": "225.78",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "825.19",
      "freeShipping": "true",
      "teacherId": "2192969",
      "teacherName": "Ms. Hanson",
      "gradeLevel": {
        "id": "3",
        "name": "Grades 6-8"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 13,
          "name": "CenturyLink"
        }
      ],
      "schoolName": "Ann Sullivan Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/sullivan-communication-center/56198/",
      "city": "Minneapolis",
      "zip": "55406-1601",
      "state": "MN",
      "stateFullName": "Minnesota",
      "latitude": "44.952116000000000",
      "longitude": "-93.226813000000000",
      "zone": {
        "id": "242",
        "name": "Minnesota"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-05-12",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1178879",
      "proposalURL": "http://www.donorschoose.org/project/creating-independence-for-students-with/1178879/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1178879&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2150089_sm.jpg?timestamp=1391430679138",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2150089_thmb.jpg?timestamp=1391430679138",
      "title": "Creating Independence for Students with Special Needs",
      "shortDescription": "- I have an energetic, amazing group of students who have special needs.&lt;br /&gt;-We complete centers/stations everyday to promote independence and one on one individualized instruction. I teach a 12:1:1...",
      "fulfillmentTrailer": "My students need Hot Dots Pens and Quiz Cards, to reinforce literacy and math skills while promoting independence and self- correction.",
      "snippets": [],
      "synopsis": "- I have an energetic, amazing group of students who have special needs.\r\n-We complete centers/stations everyday to promote independence and one on one individualized instruction. &lt;br/&gt;&lt;br/&gt;I teach a 12:1:1 class for students with severe special needs (Autism, Intellectual Disabilities, Other Health Impairments, Multiple Disabilities). My class and school is extremely supportive of the students and creating an environment that is loving. We teach functional skills that promote independence wherever possible. \r\n\r\nMy students want to be independent and with the use of centers, they can be. They have an individualized schedule which informs them where to be at what time. \r\n\r\n &lt;br/&gt;&lt;br/&gt;I am requesting different HOT DOTS materials; Comprehension, Vocabulary, and Math. HOT DOTS allows the students to be independent and self check their work with the use of an electric pen.\r\n\r\nAll three sets reinforce different reading, comprehension, and math skills that will be used at one of the center stations.  &lt;br/&gt;&lt;br/&gt;These donations will allow my students to continue to work on skills that they need constant reinforcements on. It will also allow my students to build more Independence because the pen helps them self-correct. \r\n\r\nThis will build skills for the future on how to self-correct and learn how to be as independent as possible.",
      "percentFunded": "38",
      "numDonors": "14",
      "costToComplete": "213.74",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "345.74",
      "freeShipping": "true",
      "teacherId": "2150089",
      "teacherName": "Ms. Hirsh",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "P224Q  at PS 205",
      "schoolUrl": "http://www.donorschoose.org/school/p224q-at-public-school-205/102421/",
      "city": "Bayside",
      "zip": "11364",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.787960052490234",
      "longitude": "-73.790176391601562",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-06-03",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1186684",
      "proposalURL": "http://www.donorschoose.org/project/ipad-for-applying-for-jobs/1186684/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1186684&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2235430_sm.jpg?timestamp=1392681312281",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2235430_thmb.jpg?timestamp=1392681312281",
      "title": "Ipad for Applying for Jobs!",
      "shortDescription": "For me, applying for college and jobs was easy. I could go to school and use the Internet to finish my essays or research college programs from my local library. For my students, these luxuries I...",
      "fulfillmentTrailer": "My students need an iPad and protection plan to have the ability to apply for jobs, complete college applications, and access the internet.",
      "snippets": [],
      "synopsis": "For me, applying for college and jobs was easy. I could go to school and use the Internet to finish my essays or research college programs from my local library. For my students, these luxuries I took for granted as a teenager don&#039;t come as easy. &lt;br/&gt;&lt;br/&gt;I teach 11th and 12th grade Career Exploration and Advocacy to a group of students with Emotional and Intellectual Disabilities at Ballou Senior High School. Our population of students is 99% free and reduced lunch and over 50% special education. \r\n\r\nFor many of my students they have enormous goals for themselves but don&#039;t have access to the resources to achieve them.  In our classroom that serves over a 150 students regularly we have minimal access to the technology resources my students need in order to begin applying for jobs to gain experience to become productive members of society.\r\n\r\nOver the past 5 months my students have made tremendous growth in learning about the professional and career skills they need to obtain to have a job after high school. Now they need to take the next step and apply for jobs so they can support themselves and their families after graduation. Without the necessary resources to do so this next step is becoming increasingly difficult. &lt;br/&gt;&lt;br/&gt;My students will use the iPad in the classroom in a multitude of ways. Not only will they have a reliable place to come apply for jobs before and after school, but they will also have a secure mode of technology to manage their professional email accounts and documents for hiring. Most importantly, they will also gain the technology skills to be competitive in an ever changing work force.\r\n\r\nIn addition, an iPad will allow me to record assignments and lessons for some of my students are illiterate and provide them with a read aloud and type to text accommodations to fill out job applications and create resumes. &lt;br/&gt;&lt;br/&gt;With the iPad in our classroom more students will be able to apply for jobs to boost careers that are realistic for them. They will also have the ability to contact employers and mentors about future opportunities in a place that is safe, unlike the local library and labs. Lastly, my students who otherwise aren&#039;t able to apply for jobs because they lack the academic skills to read and write will be able to use the read aloud and type to text tools to prepare for their future.",
      "percentFunded": "74",
      "numDonors": "11",
      "costToComplete": "204.86",
      "completedMatching": {
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "http://cdn.donorschoose.net/images/logos/100Women_small.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=100WOMENP14",
        "amount": "0.00",
        "completed": "true",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "789.86",
      "freeShipping": "true",
      "teacherId": "2235430",
      "teacherName": "Ms. Millson",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 1,
        "name": "Teach For America"
      }],
      "schoolTypes": [
        {
          "id": 2,
          "name": "Adult Education"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 8,
          "name": "New Leaders"
        },
        {
          "id": 6,
          "name": "Vocational Education"
        }
      ],
      "schoolName": "Ballou Senior High School",
      "schoolUrl": "http://www.donorschoose.org/school/ballou-senior-high-school/24047/",
      "city": "Washington",
      "zip": "20032-5406",
      "state": "DC",
      "stateFullName": "District of Columbia",
      "latitude": "38.840233000000000",
      "longitude": "-77.000735000000000",
      "zone": {
        "id": "114",
        "name": "Washington D.C."
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "16",
        "name": "College &amp; Career Prep",
        "groupId": "5"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-06-18",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1164880",
      "proposalURL": "http://www.donorschoose.org/project/little-fingers-breaking-barriers-with-te/1164880/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1164880&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u990314_sm.jpg?timestamp=1306887417000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u990314_thmb.jpg?timestamp=1306887417000",
      "title": "Little Fingers Breaking Barriers with Technology",
      "shortDescription": "Special needs students are just that SPECIAL and each one holds a special place in our hearts. We want to give each and every one of our students the opportunity to live up to their full...",
      "fulfillmentTrailer": "My students need access to iPad technology they can manipulate with their hands. My students have fine and gross motor delays.  We have not technology they are able to access.",
      "snippets": [],
      "synopsis": "Special needs students are just that SPECIAL and each one holds a special place in our hearts. We want to give each and every one of our students the opportunity to live up to their full potential. This is very difficult to do this when they are physically unable to access technology in my room.   &lt;br/&gt;&lt;br/&gt;My students are three to five years old with special needs. The students in our room have varying developmental disabilities. These children also come from a very low socioeconomic area. For most of these children coming to school is their safe haven. We strive to make a calm, comforting, and compassionate environment for them. We would also like to give them access to high quality educational experiences through technology. &lt;br/&gt;&lt;br/&gt;Technology and computers are very important area in an early childhood classroom. This area is where children first experience learning though technology. Technology could ultimately be a form of communication for many of my students later in life. We currently have one out of date computer in our room. My students have major problems using this computer due to fine and gross motor delays. An ipad will allow my students to gain self-esteem and satisfaction from success.\r\n\r\n &lt;br/&gt;&lt;br/&gt;Unfortunately, special education rooms are often the last to receive up-to-date technology in our county. Our classroom receives approximately two hundred dollars for our supplies yearly. That amount money doesn&#039;t even begin to cover the necessities, let alone buy replacements for broken or worn out items. Please help give our students the opportunity to explore and learn through technology. My students will not receive this opportunity for growth if not funded through Donorschoose.org.",
      "percentFunded": "62",
      "numDonors": "8",
      "costToComplete": "220.65",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "575.94",
      "freeShipping": "false",
      "teacherId": "990314",
      "teacherName": "Ms. England",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [
        {
          "id": 11,
          "name": "U.S. Cellular Teacher"
        },
        {
          "id": 5,
          "name": "SONIC Teacher"
        }
      ],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "Jefferson Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/jefferson-elementary-school/39314/",
      "city": "Parkersburg",
      "zip": "26101-4986",
      "state": "WV",
      "stateFullName": "West Virginia",
      "latitude": "39.265026000000000",
      "longitude": "-81.541594000000000",
      "zone": {
        "id": "214",
        "name": "West Virginia"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "18",
        "name": "Early Development",
        "groupId": "5"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-05-09",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1196127",
      "proposalURL": "http://www.donorschoose.org/project/kinect-sthetic-learning/1196127/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1196127&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1126808_sm.jpg?timestamp=1393552673677",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1126808_thmb.jpg?timestamp=1393552673677",
      "title": "Kinect-Sthetic Learning",
      "shortDescription": "We like to learn and find fun and exciting ways to learn! We don&#039;t just use our eyes, ears and hands, but our entire bodies! I am a teacher in a 6:1:1 classroom in a middle school for students...",
      "fulfillmentTrailer": "My students need an Xbox 360 with Kinect and games as well as a controller and charger so they can learn and exercise together in class!",
      "snippets": [],
      "synopsis": "We like to learn and find fun and exciting ways to learn! We don&#039;t just use our eyes, ears and hands, but our entire bodies! &lt;br/&gt;&lt;br/&gt;I am a teacher in a 6:1:1 classroom in a middle school for students with special needs. We have adopted the TEACCH method in our classroom. The students have a variety of learning methods which we emphasize in the class, through setting up different areas in the classroom. &lt;br/&gt;&lt;br/&gt;My students just had a visitor who brought the Kinect in to show the children in my class, and they loved it! The students had so much fun and all interacted with it in their own way. We will set up various times during the week where the students can earn Kinect time to get the exercise they need as well as learn about personal space, sharing, and cooperation.   &lt;br/&gt;&lt;br/&gt;How could this project not make a difference with my students? Just seeing the joy on their faces as they played and say their body movements translated into actions on the screen was proof enough that I needed to post this project. If you donate you will be making at least 6 students very happy, and possibly countless more!",
      "percentFunded": "57",
      "numDonors": "10",
      "costToComplete": "253.58",
      "completedMatching": {
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "http://cdn.donorschoose.net/images/logos/100Women_small.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=100WOMENP14",
        "amount": "0.00",
        "completed": "true",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "583.58",
      "freeShipping": "true",
      "teacherId": "1126808",
      "teacherName": "Mr. McKeon",
      "gradeLevel": {
        "id": "3",
        "name": "Grades 6-8"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 5,
          "name": "Year Round"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "P053K @ 088K",
      "schoolUrl": "http://www.donorschoose.org/school/p053k---088k/98761/",
      "city": "Brooklyn",
      "zip": "11215",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.660793000000000",
      "longitude": "-73.988731000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "2",
        "name": "Sports",
        "groupId": "2"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-05",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1158370",
      "proposalURL": "http://www.donorschoose.org/project/occupational-therapy-for-autistic-suppor/1158370/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1158370&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u188141_sm.jpg?timestamp=1377020106009",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u188141_thmb.jpg?timestamp=1377020106009",
      "title": "Occupational Therapy for Autistic Support",
      "shortDescription": "My students are 2nd-4th Grade Autistic Support students in a title 1 school that has seen massive budget cuts. My students need these occupational therapy tools to help them in their daily tasks....",
      "fulfillmentTrailer": "My students need tools to help them in daily educational tasks. These items include communication cards, chewy&#039;s, slant boards, and body sox. These items promote success.",
      "snippets": [],
      "synopsis": "My students are 2nd-4th Grade Autistic Support students in a title 1 school that has seen massive budget cuts. My students need these occupational therapy tools to help them in their daily tasks. Each item is used for a specific student&#039;s needs.  &lt;br/&gt;&lt;br/&gt;My students are amazing children that come from dedicated families that do the best they can to support their children. My school is a Title 1 school in a district that has slashed every departments funding in an attempt to save the district. My children have suffered by not having the proper materials provided for them.  &lt;br/&gt;&lt;br/&gt;The occupational therapy equipment such as body sox, communication tools, thereabout, Chew&#039;s and slant boards will help my students perform daily tasks. They will be able to focus on their educational learning more and make gains in their daily living skills to become successful adults.  &lt;br/&gt;&lt;br/&gt;Your generous donations will be used to enhance the learning of my amazing students. With the right interventions, therapy&#039;s, and equipment we can enhance the lives and learning of my students to help them become independent members of society. Our goals are to give them the skills they need to grow and learn.",
      "percentFunded": "74",
      "numDonors": "14",
      "costToComplete": "220.00",
      "completedMatching": {
        "matchingKey": "DISNEYP14",
        "name": "Disney",
        "type": "PROMO",
        "logoURL": "http://cdn.donorschoose.net/images/logos/disney_small.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=DISNEYP14",
        "amount": "0.00",
        "completed": "true",
        "description": "<p>Disney is amplifying the impact of teachers who rally support for their classroom projects. Any teacher who posts a new project has seven days to inspire friends and family to donate to their classrooms, and Disney will match that generosity. <a target=\"_blank\" href=\"http://help.donorschoose.org/app/answers/detail/a_id/405\">Details for teachers<\/a>.<\/p>\r\n\r\n<p>About Disney:<br>We believe that if you can dream it, you can do it. Our goal is to motivate generations of kids to harness the power of creativity to help improve their communities. The world's next great artists, innovators, athletes, engineers, architects, zoologists and dreamers are out there. Disney is thrilled to play a role in supporting teachers while providing kids with the tools they need to learn, thrive and create the future they imagine. By inspiring creativity in young people today, we hope to ignite the spark of innovation that will lead us all to a brighter tomorrow. Learn more about <a target=\"_blank\" href=\"http://www.thewaltdisneycompany.com/citizenship\">Disney's Citizenship efforts<\/a>.<\/p>"
      },
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "837.56",
      "freeShipping": "false",
      "teacherId": "188141",
      "teacherName": "Ms. Maloney",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "William H Ziegler Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/william-h-ziegler-elementary-school/90916/",
      "city": "Philadelphia",
      "zip": "19149-3446",
      "state": "PA",
      "stateFullName": "Pennsylvania",
      "latitude": "40.030111000000000",
      "longitude": "-75.075553000000000",
      "zone": {
        "id": "113",
        "name": "Pennsylvania"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-04-27",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1180772",
      "proposalURL": "http://www.donorschoose.org/project/fostering-independence/1180772/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1180772&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2217310_sm.jpg?timestamp=1391698213863",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2217310_thmb.jpg?timestamp=1391698213863",
      "title": "Fostering Independence",
      "shortDescription": "&#034;Once we accept our limits, we go beyond them,&#034; said Albert Einstein, who also had a learning disability. My students are not accepting their limitations, instead they are replacing these feelings...",
      "fulfillmentTrailer": "My students need Wizcom ReadingPens.",
      "snippets": [],
      "synopsis": "&#034;Once we accept our limits, we go beyond them,&#034; said Albert Einstein, who also had a learning disability.  My students are not accepting their limitations, instead they are replacing these feelings with confidence and independence. &lt;br/&gt;&lt;br/&gt;My students attend a public school in Chicago where 92% of students are from low income families, qualifying for free or reduced lunch.  My students are students who struggle with reading independently.  Although they are very hard working, reading is difficult for most of them.  They are with me for part of the day and in the general education setting for the other part.  The general education teachers and I work closely together to do all we can to support these students and expose them to the grade level curriculum. &lt;br/&gt;&lt;br/&gt;These Reading Pens will assist my students to become more independent when completing assignments, projects, and work.  My students will not have to rely on someone to read papers aloud when completing work that requires them to read something.  My students are very capable of making progress and being involved within the general education curriculum, they just need information read out loud to them.  With these Reading Pens my students will develop a sense of independence that they have not felt before.  The Reading Pen will also help my students improve their reading comprehension, vocabulary, and fluency. &lt;br/&gt;&lt;br/&gt;Of course, these technologies cannot and will not replace direct instruction and interventions, but it will increase self-confidence and independence, when they are working in the general education setting.  My students love to listen to books read aloud to them and with new technology this is a possibility to do so independently.",
      "percentFunded": "39",
      "numDonors": "3",
      "costToComplete": "189.93",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "309.93",
      "freeShipping": "true",
      "teacherId": "2217310",
      "teacherName": "Ms. Flood",
      "gradeLevel": {
        "id": "3",
        "name": "Grades 6-8"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 1,
          "name": "Charter"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "Cics-West Belden",
      "schoolUrl": "http://www.donorschoose.org/school/chicago-int-l-charter-school-west-belden/5532/",
      "city": "Chicago",
      "zip": "60639-2766",
      "state": "IL",
      "stateFullName": "Illinois",
      "latitude": "41.921255000000000",
      "longitude": "-87.776659000000000",
      "zone": {
        "id": "201",
        "name": "Illinois (Chicago)"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-06-10",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1192288",
      "proposalURL": "http://www.donorschoose.org/project/hot-dots-make-reading-rock/1192288/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1192288&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1191509_sm.jpg?timestamp=1393468374736",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1191509_thmb.jpg?timestamp=1393468374736",
      "title": "Hot Dots Make Reading Rock!",
      "shortDescription": "My students are energetic and eager learners who love to read and strive everyday to achieve academic success. However, many are struggling with below level reading comprehension skills and are in...",
      "fulfillmentTrailer": "My students need Hot Dots Reading Comprehension Quiz Cards - Complete Set and Hot Dots Power Pen set.",
      "snippets": [],
      "synopsis": "My students are energetic and eager learners who love to read and strive everyday to achieve academic success.  However, many are struggling with below level reading comprehension skills and are in need of remedial and intervension learning tools that help them reach higher levels. &lt;br/&gt;&lt;br/&gt;Our Title 1 school is located in Brooklyn&#039;s East New York and is considered High Poverty with all students qualifying for free lunch.  Budgets being what they are, electronic tools for academic programs are restricted or non-existent.  My General Education, ELL and Students with IEP&#039;s come from a variety of cultures and backgrounds.  But all are ready to take learning up to the next level and prepare for college. &lt;br/&gt;&lt;br/&gt;I will use the Hot Dots to create skill-building learning centers that focus on phonics, grammary and comprehension.  Students will rotate between small group instruction with me to small group and/or individual time with the Hot Dot cards.  I will also use the Hot Dot system for student comprehension checks and assessments. &lt;br/&gt;&lt;br/&gt;Your donations to my Hot Dots Make Reading Rock project will affect so many children for the better.  This tool will open up the world of reading and send my students on exciting academic adventures.  My goal is to hear my students say &#034;Reading Rocks!&#034;",
      "percentFunded": "21",
      "numDonors": "2",
      "costToComplete": "149.92",
      "completedMatching": {
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "http://cdn.donorschoose.net/images/logos/100Women_small.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=100WOMENP14",
        "amount": "0.00",
        "completed": "true",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "teacherFFPromoCodeFund": {
        "eligible": "true",
        "deadline": "March 27",
        "code": "100WOMEN",
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "100Women_small.jpg",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "totalPrice": "189.92",
      "freeShipping": "true",
      "teacherId": "1191509",
      "teacherName": "Ms. Smart",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [{
        "id": 15,
        "name": "Kia (partner)"
      }],
      "schoolName": "PS 159 Isaac Pitkin",
      "schoolUrl": "http://www.donorschoose.org/school/ps-159-isaac-pitkin/1274/",
      "city": "Brooklyn",
      "zip": "11208-3240",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.675881000000000",
      "longitude": "-73.869535000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "3",
        "name": "Literature &amp; Writing",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-07-18",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1181062",
      "proposalURL": "http://www.donorschoose.org/project/sensory-zone/1181062/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1181062&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2222696_sm.jpg?timestamp=1391724231143",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2222696_thmb.jpg?timestamp=1391724231143",
      "title": "Sensory Zone",
      "shortDescription": "My classroom is always on the go. My students are in kindergarten and first grade. They do not understand the concept of staying still to learn and love to have their hands on something. Our...",
      "fulfillmentTrailer": "My students need sensory input throughout the day to focus on their work. The weighted turtle and hound, cuddle loop and cozy shades will help my students.",
      "snippets": [],
      "synopsis": "My classroom is always on the go. My students are in kindergarten and first grade. They do not understand the concept of staying still to learn and love to have their hands on something. &lt;br/&gt;&lt;br/&gt;Our school is a Title One but you would never know by all our students learn. Everyone works very hard here and cares about the students&#039; success. This is not my students&#039; home school, they go to the school closest to their home school with my program. They all learn in just a little bit of a different way, but they do learn. &lt;br/&gt;&lt;br/&gt;The students will use the weighted animals to help them to sit and work. They will also use the animals to carry around and provide them with some sensory input. The light covers will help my students when they complain it is too bright, it gives them light but not too much and will appear as more of a natural light.\r\n\r\nSome of my students would benefit from a weighted vest or lap pad, but will not use them because they don&#039;t excite them. With the weighted animals the students would get the benefit of the supporting weight to sit longer for a reading lesson or during circle time. They would also be able to take it with them to assemblies to help them sit and participate with the rest of the school. &lt;br/&gt;&lt;br/&gt;This project will help improve my students&#039; ability to learn. My students have the will to learn and the ability, they just need some extra sensory materials to help them out. These materials could help my students sit that extra minute. If my students are able to sit longer they can receive more instruction from me as the teacher and then further their knowledge and understanding.",
      "percentFunded": "26",
      "numDonors": "2",
      "costToComplete": "145.69",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "195.69",
      "freeShipping": "false",
      "teacherId": "2222696",
      "teacherName": "Ms. Zawtocki",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 13,
          "name": "CenturyLink"
        }
      ],
      "schoolName": "Whitman Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/walt-whitman-elementary-school/59295/",
      "city": "Mesa",
      "zip": "85201-1706",
      "state": "AZ",
      "stateFullName": "Arizona",
      "latitude": "33.448524000000000",
      "longitude": "-111.835210000000000",
      "zone": {
        "id": "421",
        "name": "Arizona"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-06-09",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1201408",
      "proposalURL": "http://www.donorschoose.org/project/art-supplies/1201408/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1201408&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2268480_sm.jpg?timestamp=1394649539129",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2268480_thmb.jpg?timestamp=1394649539129",
      "title": "Art Supplies",
      "shortDescription": "Do you remember how much you liked art when you were a three year old?. I&#039;m trying to turn my classroom into a partial art room, starting with basics such as color construction paper. Learning...",
      "fulfillmentTrailer": "My students need paint, paper, rice, feathers and craft sticks.",
      "snippets": [],
      "synopsis": "Do you remember how much you liked art when you were a three year old?. I&#039;m trying to turn my classroom into a partial art room, starting with basics such as color construction paper.  Learning through doing, is the best way to teach students at such a young age.  &lt;br/&gt;&lt;br/&gt;I teach four special needs three-year-olds, and they have the most inspiring little faces you&#039;ll ever see. These student come from all over the county since they are special needs. One of the many benefits of teaching in Florida, is that our students are extremely diverse. They all come in with different types of life experiences. But as soon as they walk through the classroom door, they all need the same opportunities to develop artistic and math skills. \r\n &lt;br/&gt;&lt;br/&gt;I&#039;m requesting various art supplies from Lakeshore such as paint, construction paper, feathers, colored pasta and 3-D foam shapes. I was shocked by the amount of academic work my three-year-olds were expected to comprehend. Art is one of very few remaining subjects that my students can still fully enjoy with no boundaries. I am requesting various art materials to help my student express themselves and make connections with the different math concepts. With the new art materials, I will be able to make learning more fun. At this age, students should be learning through play.  &lt;br/&gt;&lt;br/&gt;The students are going to use the materials to make concrete connections to the concepts being taught. My students are very sensory-based and struggle with abstract thought. Being able to hold and manipulate material that relate to the concept, will help them understand what is being said.",
      "percentFunded": "35",
      "numDonors": "3",
      "costToComplete": "110.59",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "170.59",
      "freeShipping": "true",
      "teacherId": "2268480",
      "teacherName": "Ms. Brown",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 5,
        "name": "SONIC Teacher"
      }],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "Jim Allen Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/jim-allen-elementary-school/46210/",
      "city": "Cantonment",
      "zip": "32533-9306",
      "state": "FL",
      "stateFullName": "Florida",
      "latitude": "30.625509000000000",
      "longitude": "-87.322287000000000",
      "zone": {
        "id": "312",
        "name": "Florida"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "11",
        "name": "Visual Arts",
        "groupId": "1"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-07-12",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1163280",
      "proposalURL": "http://www.donorschoose.org/project/moving-to-learn/1163280/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1163280&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u2104856_sm.jpg?timestamp=1384110558619",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u2104856_thmb.jpg?timestamp=1384110558619",
      "title": "Moving to Learn",
      "shortDescription": "My students are an active bunch. They like to move, dance, and wiggle. This movement helps them learn, but can also be very distracting and disruptive to the class. I would like to create an...",
      "fulfillmentTrailer": "My students need 4 Hokki Stools so they can move to learn. Hokki Stools will allow wiggly students to move around without disrupting other students during a lesson.",
      "snippets": [],
      "synopsis": "My students are an active bunch. They like to move, dance, and wiggle. This movement helps them learn, but can also be very distracting and disruptive to the class. I would like to create an environment where students can move and wiggle and not worry about bothering anyone else. &lt;br/&gt;&lt;br/&gt;My students are kids who are excited to learn! They come to school each day hungry for knowledge and soak it up like little sponges. Our school is a Title I school, which means a high majority of the students receive free and reduced priced lunches. \r\n\r\nSome of these students do not have books or school supplies at home. I want them to be able to come to school knowing that even though they may not have these things at home, that they will have them at school. I also want to create an environment that allows my students to rich their learning potential. &lt;br/&gt;&lt;br/&gt;Have you ever walked into a kindergarten classroom? If not, picture three or four students  who cannot stop moving, wiggling, and distracting their neighbors. Even if these students are separated, it disrupts the whole classroom. The teacher is constantly redirecting and trying to refocus the group. Teaching time is wasted. Children are not learning. \r\n\r\nI have requested four Hokki stools because students will be able to move safely (ie. not rocking on the legs of a chair) without disrupting the class. &lt;br/&gt;&lt;br/&gt;Having stools that allow my students to be wiggly and move will be beneficial in my classroom because my students will be able to learn better. They will be able to move while learning and won&#039;t be distracted during lessons or a distraction to others.",
      "percentFunded": "71",
      "numDonors": "2",
      "costToComplete": "134.22",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "469.52",
      "freeShipping": "true",
      "teacherId": "2104856",
      "teacherName": "Ms. Smit",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [{
        "id": 12,
        "name": "Horace Mann (partner)"
      }],
      "schoolName": "Jim Mitchell Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/jim-mitchell-elementary-school/96188/",
      "city": "Georgetown",
      "zip": "78626-7357",
      "state": "TX",
      "stateFullName": "Texas",
      "latitude": "30.619877000000000",
      "longitude": "-97.643855000000000",
      "zone": {
        "id": "321",
        "name": "Texas"
      },
      "subject": {
        "id": "18",
        "name": "Early Development",
        "groupId": "5"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "6",
        "name": "Other"
      },
      "expirationDate": "2014-05-08",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1175705",
      "proposalURL": "http://www.donorschoose.org/project/a-soft-place-to-read/1175705/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1175705&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1782292_sm.jpg?timestamp=1382452607458",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1782292_thmb.jpg?timestamp=1382452607458",
      "title": "A Soft Place To... Read!",
      "shortDescription": "My first graders are learning how to read. Each day, they spread out in the classroom to read some of their favorite books. They will try to use their coats as a cushion to sit on since the floor...",
      "fulfillmentTrailer": "My students need 6 Soft cushions and 4 Beanbag Seats to sit on while they are reading.",
      "snippets": [],
      "synopsis": "My first graders are learning how to read. Each day, they spread out in the classroom to read some of their favorite books.  They will try to use their coats as a cushion to sit on since the floor is hard, cold tile. I encourage them to continue reading but they are often uncomfortable. &lt;br/&gt;&lt;br/&gt;I teach in a school with a program that serves 100% free breakfast and lunch due to the poverty level in the community. My students do not have the support for reading at home so I do everything I can to foster a love of reading during the school day. They are emerging readers so it is important to get them excited when they are in first grade! They are beginning to have favorite books they love to read at school. &lt;br/&gt;&lt;br/&gt;My students need 6 Soft cushions and 4 Beanbag Seats to sit on while they are reading. These resources will help my students be able to read more comfortably.  As adults, we read on couches or in bed.  When we are comfortable, we can focus on what we are reading.  Our students need to be able to think of reading as a pleasant experience rather than one where they are sitting on the hard, cold floor.  The bean bags and soft cushions will be used during the four literacy instruction blocks everyday.  By allowing them to be more comfortable, they will be able to reduce their distractions and practice reading.  This will also be a way to accommodate the learners who have special needs in my classroom.  The difference in the sensation of sitting on a cushion in a quiet space versus the floor will help those learners to be more successful. &lt;br/&gt;&lt;br/&gt;This project will drastically improve the independent practice of the literacy skills my students are learning.  They currently have two options for seating: the floor or a chair. The bean bags and soft cushions in this project will provide a soft place for sixteen people to read at one time!",
      "percentFunded": "62",
      "numDonors": "3",
      "costToComplete": "140.71",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "372.45",
      "freeShipping": "true",
      "teacherId": "1782292",
      "teacherName": "Mrs. Rowland",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [{
        "id": 12,
        "name": "Horace Mann (partner)"
      }],
      "schoolName": "Valley View Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/valley-view-elementary-school/74800/",
      "city": "Toppenish",
      "zip": "98948-1485",
      "state": "WA",
      "stateFullName": "Washington",
      "latitude": "46.382423000000000",
      "longitude": "-120.302684000000000",
      "zone": {
        "id": "404",
        "name": "Washington"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "6",
        "name": "Other"
      },
      "expirationDate": "2014-05-28",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1155062",
      "proposalURL": "http://www.donorschoose.org/project/critical-thinkers-are-lifelong-learners/1155062/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1155062&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1748264_sm.jpg?timestamp=1386698511113",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1748264_thmb.jpg?timestamp=1386698511113",
      "title": "Critical Thinkers are Lifelong Learners",
      "shortDescription": "My students face many challenges in their daily school life. Language arts curriculum is becoming increasingly challenging for students with language delays. By improving critical thinking skills,...",
      "fulfillmentTrailer": "My students need critical thinking photo prompts, games and skill books to improve their critical thinking and boost their reading comprehension.",
      "snippets": [],
      "synopsis": "My students face many challenges in their daily school life. Language arts curriculum is becoming increasingly challenging for students with language delays. By improving critical thinking skills, my students can improve their comprehension skills. &lt;br/&gt;&lt;br/&gt;I teach a class of 1st and 2nd graders with severe language and learning delays. These delays make critical thinking activities difficult. A program rich with visual materials makes these difficult topics easier to understand. In a inner city school, it is sometimes difficult to budget for these vital supplemental materials. My students can achieve at high levels, provided that they are taught in ways they can understand. Please help me provide the visual supports my class needs to be successful with critical thinking skills. A child who can think critically will become a lifelong learner. &lt;br/&gt;&lt;br/&gt;The materials we are requesting will be used to create hands-on learning centers. By introducing critical thinking skills using photos, students are presented with real life situations and scenes from everyday life. This makes it easier for my students to discuss new concepts because they can relate to the pictures. By practicing critical thinking skills in game formats, we can eliminate the added stress of writing for students still developing their writing fluency. In this way, acquisition of the skills can be assessed independent from the student&#039;s ability to write about them. &lt;br/&gt;&lt;br/&gt;One of the most important thinks we can teach a child with severe language delays is how to think critically, problem solve and express himself. By helping to provide my class with critical thinking materials, you will be helping children who struggle to express themselves to think and express themselves clearly.",
      "percentFunded": "75",
      "numDonors": "2",
      "costToComplete": "168.52",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "683.52",
      "freeShipping": "false",
      "teacherId": "1748264",
      "teacherName": "Mrs. Caraccio",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 9,
        "name": "NEA Member"
      }],
      "schoolTypes": [{
        "id": 3,
        "name": "Special Education"
      }],
      "schoolName": "Elementary School 2",
      "schoolUrl": "http://www.donorschoose.org/school/elementary-school-2/82064/",
      "city": "Paterson",
      "zip": "07501-1813",
      "state": "NJ",
      "stateFullName": "New Jersey",
      "latitude": "40.915708000000000",
      "longitude": "-74.176712000000000",
      "zone": {
        "id": "102",
        "name": "New Jersey"
      },
      "subject": {
        "id": "3",
        "name": "Literature &amp; Writing",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-04-20",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1159190",
      "proposalURL": "http://www.donorschoose.org/project/all-those-math-words/1159190/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1159190&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1853331_sm.jpg?timestamp=1395188302468",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1853331_thmb.jpg?timestamp=1395188302468",
      "title": "All Those Math Words",
      "shortDescription": "Our school has semester block schedule, which means that we have 90 min of math daily for half a year. While, this enables students to get credits quickly, it also makes them have to process...",
      "fulfillmentTrailer": "My students need Pre-Algebra word-wall-posters to help them recall previously learned math vocabulary. We also need some reproducable Geometry resources.",
      "snippets": [],
      "synopsis": "Our school has semester block schedule, which means that we have 90 min of math daily for half a year. While, this enables students to get credits quickly, it also makes them have to process information more quickly, since we have to cover one year&#039;s worth of information in one semester. &lt;br/&gt;&lt;br/&gt;I would describe my students as a very close knit group of teenagers. Even though they all seem to have different issues to deal with in life, such as being a teenage parent, coming from single parent households, being military family members and therefore have parents that are frequently away from home for as long as a year at a time, they seem to have strong friendships with each other, and look out for each other.  &lt;br/&gt;&lt;br/&gt;With this project I am asking for math wall posters. Vocabulary is a big part of mathematics. Without having a complete understanding of the language of mathematics, it is unlikely that students will understand the questions on assessment. How is it possible to answer a question you don&#039;t understand? With these posters, vocabulary will also have a graphical representation, which will help visual learners. With the Geometry activity books, we will be able to take some of the boredom out of Geometry class. &lt;br/&gt;&lt;br/&gt;Understanding the language of mathematics will help my students improve their test scores (to include state end of course tests) and it will improve their self-confidence in mathematics. Since mathematics is used in many professions, it will improve their outlook for future employment opportunities.",
      "percentFunded": "18",
      "numDonors": "2",
      "costToComplete": "196.19",
      "completedMatching": {
        "matchingKey": "DISNEYP14",
        "name": "Disney",
        "type": "PROMO",
        "logoURL": "http://cdn.donorschoose.net/images/logos/disney_small.jpg",
        "faqURL": "http://www.donorschoose.org/donors/matching_grant_popup.html?matchingKey=DISNEYP14",
        "amount": "0.00",
        "completed": "true",
        "description": "<p>Disney is amplifying the impact of teachers who rally support for their classroom projects. Any teacher who posts a new project has seven days to inspire friends and family to donate to their classrooms, and Disney will match that generosity. <a target=\"_blank\" href=\"http://help.donorschoose.org/app/answers/detail/a_id/405\">Details for teachers<\/a>.<\/p>\r\n\r\n<p>About Disney:<br>We believe that if you can dream it, you can do it. Our goal is to motivate generations of kids to harness the power of creativity to help improve their communities. The world's next great artists, innovators, athletes, engineers, architects, zoologists and dreamers are out there. Disney is thrilled to play a role in supporting teachers while providing kids with the tools they need to learn, thrive and create the future they imagine. By inspiring creativity in young people today, we hope to ignite the spark of innovation that will lead us all to a brighter tomorrow. Learn more about <a target=\"_blank\" href=\"http://www.thewaltdisneycompany.com/citizenship\">Disney's Citizenship efforts<\/a>.<\/p>"
      },
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "239.72",
      "freeShipping": "false",
      "teacherId": "1853331",
      "teacherName": "Ms. Hamlin",
      "gradeLevel": {
        "id": "4",
        "name": "Grades 9-12"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 5,
        "name": "SONIC Teacher"
      }],
      "schoolTypes": [{
        "id": 12,
        "name": "Horace Mann (partner)"
      }],
      "schoolName": "Bradwell Institute",
      "schoolUrl": "http://www.donorschoose.org/school/bradwell-institute/50010/",
      "city": "Hinesville",
      "zip": "31313-3115",
      "state": "GA",
      "stateFullName": "Georgia",
      "latitude": "31.850541000000000",
      "longitude": "-81.605781000000000",
      "zone": {
        "id": "313",
        "name": "Georgia"
      },
      "subject": {
        "id": "8",
        "name": "Mathematics",
        "groupId": "4"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "1",
        "name": "Books"
      },
      "expirationDate": "2014-04-29",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1167303",
      "proposalURL": "http://www.donorschoose.org/project/take-a-seat-lets-meet-what-a-treat/1167303/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1167303&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u205462_sm.jpg?timestamp=1348188220000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u205462_thmb.jpg?timestamp=1348188220000",
      "title": "Take A Seat! Let&#039;s Meet! What A Treat!",
      "shortDescription": "Each day my class begins with a new and exciting adventure. The students come ready and prepared to learn each day. They have a great excitement for learning and enjoy sharing their passion with...",
      "fulfillmentTrailer": "My students need a table for working in small groups, a meeting place with a teacher and a place to work independently. They also need a writing caddy to hold supplies.",
      "snippets": [],
      "synopsis": "Each day my class begins with a new and exciting adventure. The students come ready and prepared to learn each day. They have a great excitement for learning and enjoy sharing their passion with the other students. &lt;br/&gt;&lt;br/&gt;My students are amazing third graders! They are energetic and full of life! They enjoy moving from one activity to another. When given a task, my students try their best to complete their work. They love to work hard and appreciate the help they receive. &lt;br/&gt;&lt;br/&gt;I&#039;m asking for a table to use in a separate part of the classroom. This will give a sense of privacy for those who are working in small groups. By being just a few feet away from the others in the classroom, the students will be able to focus better and concentrate on the tasks presented to them. This will also allow me to meet with students in a smaller group setting. We are also asking for a writing caddy to hold our writing supplies in one location.&lt;br/&gt;&lt;br/&gt;Your donation will make a great difference in the lives of many children. This table will last for many years to come and will help build a classroom that fosters a warm and cozy environment. The students in my classroom will feel comfortable meeting with others comfortably and with a sense of privacy.",
      "percentFunded": "46",
      "numDonors": "2",
      "costToComplete": "170.66",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "313.31",
      "freeShipping": "true",
      "teacherId": "205462",
      "teacherName": "Mrs. Derwin",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "PS 31 Samuel F Dupont",
      "schoolUrl": "http://www.donorschoose.org/school/ps-31-samuel-f-dupont/548/",
      "city": "Brooklyn",
      "zip": "11222-2634",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.726978000000000",
      "longitude": "-73.954147000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-05-13",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1193515",
      "proposalURL": "http://www.donorschoose.org/project/magic-word-machines/1193515/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1193515&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u616765_sm.jpg?timestamp=1326145072000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u616765_thmb.jpg?timestamp=1326145072000",
      "title": "Magic Word Machines!",
      "shortDescription": "Remember the first book you were able to read on your own? You sounded out some of the words, but other words you knew by memory. We call these words &#034;magic&#034; words in my class because once you...",
      "fulfillmentTrailer": "My students need digital voice recorders, headphones and batteries.",
      "snippets": [],
      "synopsis": "Remember the first book you were able to read on your own? You sounded out some of the words, but other words you knew by memory. We call these words &#034;magic&#034; words in my class because once you know them you magically begin to see them everywhere! We need your help to spread the magic in my class! &lt;br/&gt;&lt;br/&gt;My kindergarten students are inquisitive, excited children. They love to come to school and learn new things every day. My classroom is an integrated co-teaching class where students with disabilities learn alongside students without disabilities. Many of the students in my class have disabilities related to speech, language and processing. \r\n\r\nMy school is a small, rigorous elementary school that serves students from a variety of backgrounds. Because of recent budget cuts in my district, we have a limited budget for new technology and materials. &lt;br/&gt;&lt;br/&gt;With the digital voice recorders, my students would be able to use technology to practice an individualized set of magic words independently. My students would be able to hear their magic words and would not need a teacher to read to them each time they practice. They would also be able to record themselves practicing their magic words, reading books, planning and narrating their writing. Not only would these tools help students learn their magic words, they would also help students to build their independence, fluency and stamina for independent writing and reading. &lt;br/&gt;&lt;br/&gt;For our students, the multisensory learning experiences these materials would give us the opportunity to have in our classroom would enrich their lives immeasurably. By helping them build their foundational reading and writing skills, the digital voice recorders would be paving the way for future success in all academic areas.",
      "percentFunded": "38",
      "numDonors": "2",
      "costToComplete": "165.40",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "teacherFFPromoCodeFund": {
        "eligible": "true",
        "deadline": "March 23",
        "code": "100WOMEN",
        "matchingKey": "100WOMENP14",
        "name": "100 Women",
        "type": "PROMO",
        "logoURL": "100Women_small.jpg",
        "description": "100 Women in Hedge Funds is proud to support DonorsChoose.org in making a difference in the lives of teachers and students. 100WHF is a global, practitioner-driven non-profit organization serving over 12,000 alternative investment management investors and professionals through educational, professional leverage and philanthropic initiatives."
      },
      "totalPrice": "265.40",
      "freeShipping": "true",
      "teacherId": "616765",
      "teacherName": "Mrs. Medina",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [{
        "id": 15,
        "name": "Kia (partner)"
      }],
      "schoolName": "PS 63 The Star Academy",
      "schoolUrl": "http://www.donorschoose.org/school/ps-63-william-mckinley/22/",
      "city": "New York",
      "zip": "10009-7322",
      "state": "NY",
      "stateFullName": "New York",
      "latitude": "40.724286000000000",
      "longitude": "-73.986425000000000",
      "zone": {
        "id": "103",
        "name": "New York (City)"
      },
      "subject": {
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      },
      "additionalSubjects": [{
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      }],
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-07-15",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1193649",
      "proposalURL": "http://www.donorschoose.org/project/basic-needs-for-autism-class/1193649/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1193649&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1012008_sm.jpg?timestamp=1379891616947",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1012008_thmb.jpg?timestamp=1379891616947",
      "title": "Basic Needs for Autism Class",
      "shortDescription": "Repetition with variety: that is what my students with autism need. Variety is the key--doing the same thing over and over isn&#039;t fun for anyone, so we need to change it up! These materials will...",
      "fulfillmentTrailer": "My students need daily practice with language arts and math concepts via computer games, workbooks, and homework practice, as well as light filters to help them focus.",
      "snippets": [],
      "synopsis": "Repetition with variety: that is what my students with autism need. Variety is the key--doing the same thing over and over isn&#039;t fun for anyone, so we need to change it up! These materials will allow me to present concepts in multiple engaging ways. &lt;br/&gt;&lt;br/&gt;My students are readers, writers, mathematicians, dinosaur-lovers, car experts, Lego-builders, artists, experimenters, computer geniuses, and pretty smart cookies! They also all happen to have autism. Each one is unique and has his or her own special interests. \r\n\r\nMy school has a high percentage of students living in poverty and dealing with additional challenges such as single-parent homes and language barriers. My students are no exception and live with these situations in addition to their autism. &lt;br/&gt;&lt;br/&gt;Because we are a separate classroom, my students remain with me for multiple years. As a result, many materials can become overused and boring. I constantly need new ideas and new materials to keep their interest while also meeting their ever-changing needs, but the cost of doing that adds up very quickly.\r\nThese materials will provide daily practice with language arts and math concepts. I would like to have a SmartBoard center for students to practice with the CD games while other students work with staff members to complete daily journals. Carryover to the home can occur through the use of the school-to-home comprehension kit.\r\nFinally, the light filters will help my students to better focus. The fluorescent lighting in the classroom is difficult for them to handle while working. &lt;br/&gt;&lt;br/&gt;Your donation will help provide my students with engaging materials and new experiences. They are constantly learning and growing, and there&#039;s no telling how far we can go with the appropriate items in our classroom!",
      "percentFunded": "60",
      "numDonors": "3",
      "costToComplete": "145.40",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "365.40",
      "freeShipping": "true",
      "teacherId": "1012008",
      "teacherName": "Ms. McNeill",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [{
        "id": 5,
        "name": "SONIC Teacher"
      }],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 5,
          "name": "Year Round"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 13,
          "name": "CenturyLink"
        }
      ],
      "schoolName": "South Graham Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/south-graham-elementary-school/2218/",
      "city": "Graham",
      "zip": "27253-3723",
      "state": "NC",
      "stateFullName": "North Carolina",
      "latitude": "36.051498000000000",
      "longitude": "-79.394747000000000",
      "zone": {
        "id": "301",
        "name": "North Carolina"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-07-01",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1178385",
      "proposalURL": "http://www.donorschoose.org/project/lets-get-organized/1178385/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1178385&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1931633_sm.jpg?timestamp=1378589753209",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1931633_thmb.jpg?timestamp=1378589753209",
      "title": "Let&#039;s Get Organized!",
      "shortDescription": "It is very important to teach children to be independent and organized at a young age. Organization and independence contribute to a child&#039;s academic success. Setting up the classroom where...",
      "fulfillmentTrailer": "My students need cubbies and folders to keep their assignments organized.",
      "snippets": [],
      "synopsis": "It is very important to teach children to be independent and organized at a young age. Organization and independence contribute to a child&#039;s academic success. Setting up the classroom where students know where papers and supplies go will help us reach this goal. &lt;br/&gt;&lt;br/&gt;My students are bright, lively, and eager 2nd and 3rd grade learners. They have a variety of special needs including Specific Learning Disabilities, Autism, Developmental Delays, and Speech and Language Impairments. They are always so energetic and enthusiastic about learning, despite the many challenges they may encounter in their daily lives.\r\n\r\nOur school is located in the heart of South Los Angeles where the majority of students come from very low income households. Many of their homes lack essential educational resources as well as basic necessities for living. Our school has a diverse population with a large concentration of English Language Learners. &lt;br/&gt;&lt;br/&gt;My students need cubbies. It is so important that they have a place to put their homework and assignments, especially one that is sturdy and easy for my students to use. With these cubbies, each student will have their own slot that will include any papers that need to be sent home such as announcements, graded papers, and homework. This will save my students time from scrambling through their desk and backpack to find their papers. My students also needs folders to organize their writing assignments. During writing time, we learned that writing is a process. It may take more than one draft to produce the final piece.  So, we need a folder to store all of our writing which includes the brainstorming piece, rough drafts, edits/revisions, and finally, the final draft. &lt;br/&gt;&lt;br/&gt;I always want to provide the best learning experience for my students. I believe that an organized classroom will benefit my students as it will save us time and teach my students the importance of organizational skills. Your contribution to this project will not only make a difference in our classroom but it will make a lasting impact on my students&#039; success by building lifelong skills in organization and independence.",
      "percentFunded": "46",
      "numDonors": "2",
      "costToComplete": "152.19",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "283.40",
      "freeShipping": "true",
      "teacherId": "1931633",
      "teacherName": "Ms. Tang",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [{
        "id": 15,
        "name": "Kia (partner)"
      }],
      "schoolName": "South Park Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/south-park-elementary-school/7598/",
      "city": "Los Angeles",
      "zip": "90003-3119",
      "state": "CA",
      "stateFullName": "California",
      "latitude": "33.960873000000000",
      "longitude": "-118.266243000000000",
      "zone": {
        "id": "411",
        "name": "California (South)"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-06-05",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1190946",
      "proposalURL": "http://www.donorschoose.org/project/wiggle-wiggle-wiggle/1190946/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1190946&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1669481_sm.jpg?timestamp=1375152996527",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1669481_thmb.jpg?timestamp=1375152996527",
      "title": "Wiggle wiggle wiggle!",
      "shortDescription": "Learning is difficult enough for all students. My special needs children have the odds stacked against them! I&#039;m constantly reevaluating ways to minimize distractions and make the concepts I&#039;m...",
      "fulfillmentTrailer": "My students need three wobble chairs.",
      "snippets": [],
      "synopsis": "Learning is difficult enough for all students. My special needs children have the odds stacked against them! I&#039;m constantly reevaluating ways to minimize distractions and make the concepts I&#039;m teaching relevant to them in their unique lives. &lt;br/&gt;&lt;br/&gt;I teach the kids that need extra help to succeed in their regular classroom. In addition, most of my students live below the poverty line. They aren&#039;t guaranteed food, love, and attention when they go home. School for most of them is the best place to be. In spite of their circumstances, they come to me ready to do their best! &lt;br/&gt;&lt;br/&gt;The majority of my students have hyperactivity, attention, and/or sensory issues. I have heard research as well as talked to fellow teachers who have had tremendous success with Wobble Stools. The bottom part of the stool is rounded. The children will be able to have movement and sensory input while still staying in their defined space.   &lt;br/&gt;&lt;br/&gt;Attention problems make my kids miss so much. If they can have that little bit of movement, it will help keep their brains active. Then they can listen to what I have to say, think more clearly, and ultimately be more successful!",
      "percentFunded": "22",
      "numDonors": "3",
      "costToComplete": "175.78",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "226.66",
      "freeShipping": "true",
      "teacherId": "1669481",
      "teacherName": "Mrs. Grant",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        }
      ],
      "schoolName": "Duncan Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/duncan-elementary-school/6356/",
      "city": "Duncan",
      "zip": "29334-9699",
      "state": "SC",
      "stateFullName": "South Carolina",
      "latitude": "34.929356000000000",
      "longitude": "-82.127524000000000",
      "zone": {
        "id": "303",
        "name": "South Carolina"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "10",
        "name": "Literacy",
        "groupId": "6"
      }],
      "resource": {
        "id": "6",
        "name": "Other"
      },
      "expirationDate": "2014-06-27",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1184329",
      "proposalURL": "http://www.donorschoose.org/project/our-ipad-needs-protection/1184329/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1184329&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1851749_sm.jpg?timestamp=1369770907236",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1851749_thmb.jpg?timestamp=1369770907236",
      "title": "Our iPad Needs Protection!",
      "shortDescription": "Speech-language therapy happens all over our school building! My students are hard-working students who come from low, socio-economic homes. Many don&#039;t have the opportunity to use technology at...",
      "fulfillmentTrailer": "My students need an iPad case to protect our iPad and headphones so we can make better use of our iPad in the classroom.",
      "snippets": [],
      "synopsis": "Speech-language therapy happens all over our school building! &lt;br/&gt;&lt;br/&gt;My students are hard-working students who come from low, socio-economic homes.  Many don&#039;t have the opportunity to use technology at home, and try to take advantage of every opportunity at school to use a tablet or laptop computer.  They each have such big hopes and dreams they are pursuing!   &lt;br/&gt;&lt;br/&gt;Speech and language therapy happens in all parts of our school building - many times in the hallway or in the back of different classrooms.  We would love to have an iPad case and headphones to use with our iPad to help protect it, and be able to use it without bothering other classes and students.  Many of my students have difficulty reading and need the applications to read text to them so they are the most successful. That is difficult when we&#039;re in the hallway or working in classrooms because we interrupt others around us.  They&#039;ll be able to use the iPad to maximally benefit their own learning.   &lt;br/&gt;&lt;br/&gt;This project will allow all my students to use the iPad.  I don&#039;t want to keep it from some students just because I&#039;m fearful of it being broken when they touch (drop) it due to their own physical difficulties, but that is happening right now. These are students who would would benefit so much from the language and communication apps the iPad offers!  It will also allow us to use the iPad without interrupting other classes.  Thanks for your help!!",
      "percentFunded": "20",
      "numDonors": "2",
      "costToComplete": "131.56",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "164.21",
      "freeShipping": "true",
      "teacherId": "1851749",
      "teacherName": "Mrs. Morris",
      "gradeLevel": {
        "id": "2",
        "name": "Grades 3-5"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [
        {
          "id": 11,
          "name": "U.S. Cellular Teacher"
        },
        {
          "id": 5,
          "name": "SONIC Teacher"
        }
      ],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 14,
          "name": "Kia (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 15,
          "name": "Kia (partner)"
        }
      ],
      "schoolName": "Crestview Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/crestview-elementary-school/76721/",
      "city": "Kansas City",
      "zip": "64116-2198",
      "state": "MO",
      "stateFullName": "Missouri",
      "latitude": "39.173290000000000",
      "longitude": "-94.570267000000000",
      "zone": {
        "id": "223",
        "name": "Missouri"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "resource": {
        "id": "2",
        "name": "Technology"
      },
      "expirationDate": "2014-06-12",
      "fundingStatus": "needs funding"
    },
    {
      "id": "1188383",
      "proposalURL": "http://www.donorschoose.org/project/play-your-way-to-kindergarten/1188383/?utm_source=api&utm_medium=feed&utm_content=bodylink&utm_campaign=DONORSCHOOSE",
      "fundURL": "https://secure.donorschoose.org/donors/givingCart.html?proposalid=1188383&donationAmount=45&utm_source=api&utm_medium=feed&utm_content=fundlink&utm_campaign=DONORSCHOOSE",
      "imageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/small/u1063721_sm.jpg?timestamp=1329922540000",
      "thumbImageURL": "http://s3.donorschoose.net/donorschoose-storage/dc_prod/images/user/thumbnail/u1063721_thmb.jpg?timestamp=1329922540000",
      "title": "Play Your Way to Kindergarten!",
      "shortDescription": "Every child deserves every chance to be able to independently manage the items in the world around them. We need a little more to help to be able to manipulate the objects in our world. Our...",
      "fulfillmentTrailer": "My students need materials to help with tactile exploration and small motor skills like a drill activity center, beads and puzzles which will allow for small motor play.",
      "snippets": [],
      "synopsis": "Every child deserves every chance to be able to independently manage the items in the world around them. We need a little more to help to be able to manipulate the objects in our world. &lt;br/&gt;&lt;br/&gt;Our students are wonderful! They are ages 3-5 years old with autism, developmental delays, down syndrome, cerebral palsy, speech impairments, and hearing impairments, as well as their typically developing peers. We also service some students that come from bilingual homes.  We use a combination of play and specialized therapies to encourage cognitive and motor development and meet the diverse needs of our classroom. &lt;br/&gt;&lt;br/&gt;We are in need of materials to help with tactile exploration and small motor skills. The ability to control your motor movements in purposeful ways is important developmentally.  Varied materials will keep their interest high and as we all know, excited children &#034;work&#034; harder! We have requested a drill station where the students can match colors and &#034;drill&#034; to increase motor planning and cognitive skills.  We have requested bead pattern activities and puzzles for cognitive mapping skills and small motor skills.  We will use these activities during play to increase these skills lacking in so many of our students.   &lt;br/&gt;&lt;br/&gt;The ability to maneuver objects independently is very important in the development of children. Our students need every opportunity we can give them to continue to try to work with their peers to develop those motor skills. Please help us.",
      "percentFunded": "29",
      "numDonors": "2",
      "costToComplete": "186.24",
      "matchingFund": {
        "matchingKey": "",
        "name": "",
        "type": "",
        "logoURL": "",
        "faqURL": "",
        "amount": "0.00",
        "description": ""
      },
      "totalPrice": "261.24",
      "freeShipping": "false",
      "teacherId": "1063721",
      "teacherName": "Mrs. Mathis",
      "gradeLevel": {
        "id": "1",
        "name": "Grades PreK-2"
      },
      "povertyLevel": "Highest Poverty",
      "teacherTypes": [
        {
          "id": 9,
          "name": "NEA Member"
        },
        {
          "id": 5,
          "name": "SONIC Teacher"
        }
      ],
      "schoolTypes": [
        {
          "id": 12,
          "name": "Horace Mann (partner)"
        },
        {
          "id": 3,
          "name": "Special Education"
        },
        {
          "id": 13,
          "name": "CenturyLink"
        }
      ],
      "schoolName": "Joseph W Lisenby Elementary School",
      "schoolUrl": "http://www.donorschoose.org/school/joseph-w-lisenby-elementary-school/14121/",
      "city": "Ozark",
      "zip": "36360-1110",
      "state": "AL",
      "stateFullName": "Alabama",
      "latitude": "31.470768000000000",
      "longitude": "-85.628577000000000",
      "zone": {
        "id": "311",
        "name": "Alabama"
      },
      "subject": {
        "id": "23",
        "name": "Special Needs",
        "groupId": "7"
      },
      "additionalSubjects": [{
        "id": "18",
        "name": "Early Development",
        "groupId": "5"
      }],
      "resource": {
        "id": "3",
        "name": "Supplies"
      },
      "expirationDate": "2014-06-26",
      "fundingStatus": "needs funding"
    }
  ]
}
